content/emacs-lisp.org
#+TITLE: Emacs Lisp for Experienced Developers
#+DATE: 2025-10-14
#+AUTHOR: Kyeongsoo
#+OPTIONS: toc:t num:t

* Introduction

If you're coming from Python, JavaScript, Java, or similar languages, Emacs Lisp (Elisp) might look unfamiliar with its parentheses-heavy syntax. But the concepts are the same. This guide will help you map what you already know to Elisp idioms.

Emacs Lisp is a dialect of Lisp that powers Emacs. It's dynamically typed, has first-class functions, and everything is built around S-expressions (symbolic expressions). The power of Elisp lies in its ability to extend and customize Emacs itself.

* Basic Syntax and Evaluation

** S-expressions (Symbolic Expressions)

In Lisp, code and data share the same structure: lists enclosed in parentheses.

#+BEGIN_SRC emacs-lisp
;; Function call: (function-name arg1 arg2 ...)
(+ 2 3)  ; => 5

;; Compare to other languages:
;; Python:     2 + 3
;; JavaScript: 2 + 3
;; Java:       2 + 3
#+END_SRC

The first element in a list is the function, followed by its arguments. This is called "prefix notation."

** Variables

#+BEGIN_SRC emacs-lisp
;; Local variable (lexically scoped)
(let ((name "Alice")
      (age 30))
  (message "Name: %s, Age: %d" name age))

;; Global variable
(defvar my-global-var 42
  "A global variable with documentation.")

;; Custom variable (user-configurable)
(defcustom my-custom-var 100
  "A customizable variable."
  :type 'integer
  :group 'my-package)

;; Set a variable
(setq my-var 10)

;; Set multiple variables
(setq x 1
      y 2
      z 3)
#+END_SRC

Compare to other languages:
#+BEGIN_SRC python
# Python
name = "Alice"
age = 30
#+END_SRC

#+BEGIN_SRC javascript
// JavaScript
let name = "Alice";
let age = 30;
#+END_SRC

* Control Flow

** Conditionals

*** if/else

#+BEGIN_SRC emacs-lisp
;; Basic if
(if (> x 10)
    (message "x is greater than 10")
  (message "x is 10 or less"))

;; if with multiple statements in then-branch
(if (< x 0)
    (progn
      (message "x is negative")
      (setq x 0))
  (message "x is non-negative"))
#+END_SRC

Compare to:
#+BEGIN_SRC python
# Python
if x > 10:
    print("x is greater than 10")
else:
    print("x is 10 or less")
#+END_SRC

#+BEGIN_SRC javascript
// JavaScript
if (x > 10) {
    console.log("x is greater than 10");
} else {
    console.log("x is 10 or less");
}
#+END_SRC

