emacs-lisp.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Emacs Lisp for Experienced Developers</title>
<meta name="generator" content="Org Mode" />
<meta name="viewport" content="width=device-width, initial-scale=1"><link rel="stylesheet" href="/assets/styles/toc-sidebar.css"></head>
<body>
<main id="content" class="prose prose-zinc dark:prose-invert mx-auto w-full max-w-xl md:max-w-xl lg:max-w-2xl xl:max-w-3xl px-4 sm:px-6 lg:px-8">
<h1 class="title">Emacs Lisp for Experienced Developers</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org002a7b2">1. Introduction</a></li>
<li><a href="#org27c2180">2. Basic Syntax and Evaluation</a>
<ul>
<li><a href="#org5c22ef0">2.1. S-expressions (Symbolic Expressions)</a></li>
<li><a href="#org45265f4">2.2. Variables</a></li>
</ul>
</li>
<li><a href="#org0c0edf5">3. Control Flow</a>
<ul>
<li><a href="#org0ef2e27">3.1. Conditionals</a>
<ul>
<li><a href="#orgdefda90">3.1.1. if/else</a></li>
<li><a href="#org7b83bec">3.1.2. when and unless</a></li>
<li><a href="#org612a9bb">3.1.3. cond (switch/case equivalent)</a></li>
<li><a href="#org4828750">3.1.4. pcase (pattern matching)</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org6d92fa7">4. Loops and Iteration</a>
<ul>
<li><a href="#org5ea4b5b">4.1. while loop</a></li>
<li><a href="#org76dcce0">4.2. dotimes (for loop with counter)</a></li>
<li><a href="#orgf1b0259">4.3. dolist (foreach loop)</a></li>
<li><a href="#orgd909b8c">4.4. cl-loop (powerful iteration macro)</a></li>
<li><a href="#orga6deec3">4.5. mapcar (map/transform)</a></li>
<li><a href="#orgf622947">4.6. seq-filter (filter)</a></li>
</ul>
</li>
<li><a href="#orgef52d02">5. Recursion</a>
<ul>
<li><a href="#org1d95262">5.1. Understanding Tail-Call Optimization</a></li>
<li><a href="#org548d805">5.2. Simple Recursion</a></li>
<li><a href="#org7d453e2">5.3. Tail Recursion with Named let</a></li>
<li><a href="#org1ca567a">5.4. List Recursion</a></li>
<li><a href="#org1fb602e">5.5. Tree Recursion</a></li>
</ul>
</li>
<li><a href="#orga4df3ee">6. Functions</a>
<ul>
<li><a href="#org8c0da96">6.1. Defining Functions</a></li>
<li><a href="#org3f6863c">6.2. Lambda Functions (Anonymous Functions)</a></li>
<li><a href="#org76189df">6.3. Interactive Functions (Commands)</a></li>
</ul>
</li>
<li><a href="#org2ffb4ca">7. Data Structures</a>
<ul>
<li><a href="#orgf7641b8">7.1. Lists</a></li>
<li><a href="#org8a2c78c">7.2. Association Lists (alists)</a></li>
<li><a href="#orgaede4b4">7.3. Hash Tables</a></li>
<li><a href="#orgf334343">7.4. Vectors (Arrays)</a></li>
</ul>
</li>
<li><a href="#orga0248ce">8. String Operations</a></li>
<li><a href="#org60ec7ae">9. Practical Emacs Functions</a>
<ul>
<li><a href="#orgcdc1c8c">9.1. Buffer and File Manipulation</a>
<ul>
<li><a href="#org4d2f4cd">9.1.1. Quick File Opening</a></li>
<li><a href="#orge58c7b2">9.1.2. Duplicate Current Line</a></li>
<li><a href="#org0e2964e">9.1.3. Move Line Up/Down</a></li>
</ul>
</li>
<li><a href="#org37c5d9a">9.2. Text Processing</a>
<ul>
<li><a href="#org9d32e56">9.2.1. Sort Lines by Length</a></li>
<li><a href="#org9d4f2e1">9.2.2. Insert UUID</a></li>
<li><a href="#org598154c">9.2.3. Count Words in Region</a></li>
</ul>
</li>
<li><a href="#org7c8798f">9.3. Window and Buffer Management</a>
<ul>
<li><a href="#org81897b7">9.3.1. Split Window and Move to It</a></li>
<li><a href="#orgbf4aefb">9.3.2. Kill Other Buffers</a></li>
<li><a href="#orge8f4890">9.3.3. Toggle Between Most Recent Buffers</a></li>
</ul>
</li>
<li><a href="#org17ed0aa">9.4. Search and Navigation</a>
<ul>
<li><a href="#org836a868">9.4.1. Search in Project</a></li>
<li><a href="#org6869f28">9.4.2. Jump to Previous/Next Blank Line</a></li>
</ul>
</li>
<li><a href="#org46aaab2">9.5. Development Helpers</a>
<ul>
<li><a href="#org237d1ab">9.5.1. Insert Current Timestamp</a></li>
<li><a href="#org386962d">9.5.2. Comment or Uncomment Region with Repeat</a></li>
<li><a href="#orgfabd9a1">9.5.3. Open URL at Point</a></li>
</ul>
</li>
<li><a href="#orga7fed09">9.6. Automation and Workflow</a>
<ul>
<li><a href="#org7fba086">9.6.1. Auto-Insert File Headers</a></li>
<li><a href="#org940ae6a">9.6.2. Quick Scratch Buffer</a></li>
</ul>
</li>
<li><a href="#orgc4f3549">9.7. Advanced: Macros and Code Generation</a>
<ul>
<li><a href="#org1fbd15d">9.7.1. Create Getters and Setters</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org085dbd9">10. Error Handling</a></li>
<li><a href="#orgd36854b">11. Common Pitfalls for New Users</a>
<ul>
<li><a href="#org9e4e7fa">11.1. 1. nil vs '()</a></li>
<li><a href="#org2f701df">11.2. 2. t vs non-nil</a></li>
<li><a href="#org413c624">11.3. 3. setq vs setf vs let</a></li>
<li><a href="#orga82c0f5">11.4. 4. Quote vs Backquote</a></li>
</ul>
</li>
<li><a href="#org2e818f5">12. Resources and Next Steps</a>
<ul>
<li><a href="#org386c852">12.1. Learning More</a></li>
<li><a href="#orgf9ff1c0">12.2. Practice Exercises</a></li>
<li><a href="#org101f92d">12.3. Common Libraries</a></li>
</ul>
</li>
<li><a href="#org7f3ae84">13. Conclusion</a></li>
</ul>
</div>
</div>

<div id="outline-container-org002a7b2" class="outline-2">
<h2 id="org002a7b2"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
If you're coming from Python, JavaScript, Java, or similar languages, Emacs Lisp (Elisp) might look unfamiliar with its parentheses-heavy syntax. But the concepts are the same. This guide will help you map what you already know to Elisp idioms.
</p>

<p>
Emacs Lisp is a dialect of Lisp that powers Emacs. It's dynamically typed, has first-class functions, and everything is built around S-expressions (symbolic expressions). The power of Elisp lies in its ability to extend and customize Emacs itself.
</p>
</div>
</div>

<div id="outline-container-org27c2180" class="outline-2">
<h2 id="org27c2180"><span class="section-number-2">2.</span> Basic Syntax and Evaluation</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org5c22ef0" class="outline-3">
<h3 id="org5c22ef0"><span class="section-number-3">2.1.</span> S-expressions (Symbolic Expressions)</h3>
<div class="outline-text-3" id="text-2-1">
<p>
In Lisp, code and data share the same structure: lists enclosed in parentheses.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">Function call: (function-name arg1 arg2 ...)
</span>(+ 2 3)  <span class="org-comment-delimiter">; </span><span class="org-comment">=&gt; 5
</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">Compare to other languages:
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">Python:     2 + 3
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">JavaScript: 2 + 3
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">Java:       2 + 3</span>
</pre>
</div>

<p>
The first element in a list is the function, followed by its arguments. This is called "prefix notation."
</p>
</div>
</div>

<div id="outline-container-org45265f4" class="outline-3">
<h3 id="org45265f4"><span class="section-number-3">2.2.</span> Variables</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">Local variable (lexically scoped)
</span>(<span class="org-keyword">let</span> ((name <span class="org-string">"Alice"</span>)
      (age 30))
  (message <span class="org-string">"Name: %s, Age: %d"</span> name age))

<span class="org-comment-delimiter">;; </span><span class="org-comment">Global variable
</span>(<span class="org-keyword">defvar</span> <span class="org-variable-name">my-global-var</span> 42
  <span class="org-doc">"A global variable with documentation."</span>)

<span class="org-comment-delimiter">;; </span><span class="org-comment">Custom variable (user-configurable)
</span>(<span class="org-keyword">defcustom</span> <span class="org-variable-name">my-custom-var</span> 100
  <span class="org-doc">"A customizable variable."</span>
  <span class="org-builtin">:type</span> 'integer
  <span class="org-builtin">:group</span> 'my-package)

<span class="org-comment-delimiter">;; </span><span class="org-comment">Set a variable
</span>(<span class="org-keyword">setq</span> my-var 10)

<span class="org-comment-delimiter">;; </span><span class="org-comment">Set multiple variables
</span>(<span class="org-keyword">setq</span> x 1
      y 2
      z 3)
</pre>
</div>

<p>
Compare to other languages:
</p>
<div class="org-src-container">
<pre class="src src-python"><span class="org-comment-delimiter"># </span><span class="org-comment">Python
</span><span class="org-variable-name">name</span> <span class="org-operator">=</span> <span class="org-string">"Alice"</span>
<span class="org-variable-name">age</span> <span class="org-operator">=</span> 30
</pre>
</div>

<div class="org-src-container">
<pre class="src src-javascript"><span class="org-comment-delimiter">// </span><span class="org-comment">JavaScript
</span><span class="org-keyword">let</span> <span class="org-variable-name">name</span> = <span class="org-string">"Alice"</span>;
<span class="org-keyword">let</span> <span class="org-variable-name">age</span> = 30;
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org0c0edf5" class="outline-2">
<h2 id="org0c0edf5"><span class="section-number-2">3.</span> Control Flow</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org0ef2e27" class="outline-3">
<h3 id="org0ef2e27"><span class="section-number-3">3.1.</span> Conditionals</h3>
<div class="outline-text-3" id="text-3-1">
</div>
<div id="outline-container-orgdefda90" class="outline-4">
<h4 id="orgdefda90"><span class="section-number-4">3.1.1.</span> if/else</h4>
<div class="outline-text-4" id="text-3-1-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">Basic if
</span>(<span class="org-keyword">if</span> (&gt; x 10)
    (message <span class="org-string">"x is greater than 10"</span>)
  (message <span class="org-string">"x is 10 or less"</span>))

<span class="org-comment-delimiter">;; </span><span class="org-comment">if with multiple statements in then-branch
</span>(<span class="org-keyword">if</span> (&lt; x 0)
    (<span class="org-keyword">progn</span>
      (message <span class="org-string">"x is negative"</span>)
      (<span class="org-keyword">setq</span> x 0))
  (message <span class="org-string">"x is non-negative"</span>))
</pre>
</div>

<p>
Compare to:
</p>
<div class="org-src-container">
<pre class="src src-python"><span class="org-comment-delimiter"># </span><span class="org-comment">Python
</span><span class="org-keyword">if</span> x <span class="org-operator">&gt;</span> 10:
    <span class="org-builtin">print</span>(<span class="org-string">"x is greater than 10"</span>)
<span class="org-keyword">else</span>:
    <span class="org-builtin">print</span>(<span class="org-string">"x is 10 or less"</span>)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-javascript"><span class="org-comment-delimiter">// </span><span class="org-comment">JavaScript
</span><span class="org-keyword">if</span> (x &gt; 10) {
    console.log(<span class="org-string">"x is greater than 10"</span>);
} <span class="org-keyword">else</span> {
    console.log(<span class="org-string">"x is 10 or less"</span>);
}
</pre>
</div>
</div>
</div>
