content/emacs-lisp.org
*** when and unless

These are cleaner for single-branch conditions:

#+BEGIN_SRC emacs-lisp
;; when: execute when condition is true
(when (> x 10)
  (message "x is big")
  (setq x 0))

;; unless: execute when condition is false
(unless (file-exists-p "config.el")
  (message "Config file not found")
  (create-default-config))
#+END_SRC

Compare to:
#+BEGIN_SRC python
# Python
if x > 10:
    print("x is big")
    x = 0

if not os.path.exists("config.el"):
    print("Config file not found")
    create_default_config()
#+END_SRC

*** cond (switch/case equivalent)

#+BEGIN_SRC emacs-lisp
(cond
 ((< x 0) (message "negative"))
 ((= x 0) (message "zero"))
 ((< x 10) (message "small positive"))
 ((< x 100) (message "medium positive"))
 (t (message "large positive")))  ; t is the default case (like "else")
#+END_SRC

Compare to:
#+BEGIN_SRC python
# Python
if x < 0:
    print("negative")
elif x == 0:
    print("zero")
elif x < 10:
    print("small positive")
elif x < 100:
    print("medium positive")
else:
    print("large positive")
#+END_SRC

#+BEGIN_SRC javascript
// JavaScript (modern switch with fall-through prevention)
switch (true) {
    case x < 0:
        console.log("negative");
        break;
    case x === 0:
        console.log("zero");
        break;
    case x < 10:
        console.log("small positive");
        break;
    case x < 100:
        console.log("medium positive");
        break;
    default:
        console.log("large positive");
}
#+END_SRC

*** pcase (pattern matching)

Modern Elisp has powerful pattern matching:

#+BEGIN_SRC emacs-lisp
(pcase value
  ('nil (message "It's nil"))
  ('t (message "It's t"))
  (0 (message "It's zero"))
  ((pred stringp) (message "It's a string: %s" value))
  ((pred numberp) (message "It's a number: %d" value))
  (`(,a ,b) (message "It's a two-element list: %s, %s" a b))
  (_ (message "Something else")))
#+END_SRC

* Loops and Iteration

** while loop

#+BEGIN_SRC emacs-lisp
(let ((i 0))
  (while (< i 5)
    (message "i = %d" i)
    (setq i (1+ i))))
#+END_SRC

Compare to:
#+BEGIN_SRC python
# Python
i = 0
while i < 5:
    print(f"i = {i}")
    i += 1
#+END_SRC

** dotimes (for loop with counter)

#+BEGIN_SRC emacs-lisp
;; Loop from 0 to 4
(dotimes (i 5)
  (message "i = %d" i))

;; With result value
(dotimes (i 5 "done")
  (message "i = %d" i))
#+END_SRC

Compare to:
#+BEGIN_SRC python
# Python
for i in range(5):
    print(f"i = {i}")
#+END_SRC

#+BEGIN_SRC javascript
// JavaScript
for (let i = 0; i < 5; i++) {
    console.log(`i = ${i}`);
}
#+END_SRC

** dolist (foreach loop)

#+BEGIN_SRC emacs-lisp
(dolist (item '(apple banana cherry))
  (message "Fruit: %s" item))

;; With index using cl-loop
(require 'cl-lib)
(cl-loop for item in '(apple banana cherry)
         for i from 0
         do (message "%d: %s" i item))
#+END_SRC

Compare to:
#+BEGIN_SRC python
# Python
for item in ['apple', 'banana', 'cherry']:
    print(f"Fruit: {item}")

for i, item in enumerate(['apple', 'banana', 'cherry']):
    print(f"{i}: {item}")
#+END_SRC

#+BEGIN_SRC javascript
// JavaScript
['apple', 'banana', 'cherry'].forEach(item => {
    console.log(`Fruit: ${item}`);
});

['apple', 'banana', 'cherry'].forEach((item, i) => {
    console.log(`${i}: ${item}`);
});
#+END_SRC

** cl-loop (powerful iteration macro)

The ~cl-loop~ macro from Common Lisp is very powerful:

#+BEGIN_SRC emacs-lisp
(require 'cl-lib)

;; Collect squares
(cl-loop for i from 1 to 5
         collect (* i i))
;; => (1 4 9 16 25)

;; Sum numbers
(cl-loop for i from 1 to 10
         sum i)
;; => 55

;; Filter and transform
(cl-loop for i from 1 to 10
         when (cl-evenp i)
         collect (* i 2))
;; => (4 8 12 16 20)

;; Iterate over lists
(cl-loop for item in '(1 2 3 4 5)
         when (> item 2)
         collect item)
;; => (3 4 5)
#+END_SRC

