emacs-lisp.html

<div id="outline-container-org7b83bec" class="outline-4">
<h4 id="org7b83bec"><span class="section-number-4">3.1.2.</span> when and unless</h4>
<div class="outline-text-4" id="text-3-1-2">
<p>
These are cleaner for single-branch conditions:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">when: execute when condition is true
</span>(<span class="org-keyword">when</span> (&gt; x 10)
  (message <span class="org-string">"x is big"</span>)
  (<span class="org-keyword">setq</span> x 0))

<span class="org-comment-delimiter">;; </span><span class="org-comment">unless: execute when condition is false
</span>(<span class="org-keyword">unless</span> (file-exists-p <span class="org-string">"config.el"</span>)
  (message <span class="org-string">"Config file not found"</span>)
  (create-default-config))
</pre>
</div>

<p>
Compare to:
</p>
<div class="org-src-container">
<pre class="src src-python"><span class="org-comment-delimiter"># </span><span class="org-comment">Python
</span><span class="org-keyword">if</span> x <span class="org-operator">&gt;</span> 10:
    <span class="org-builtin">print</span>(<span class="org-string">"x is big"</span>)
    <span class="org-variable-name">x</span> <span class="org-operator">=</span> 0

<span class="org-keyword">if</span> <span class="org-keyword">not</span> os.path.exists(<span class="org-string">"config.el"</span>):
    <span class="org-builtin">print</span>(<span class="org-string">"Config file not found"</span>)
    create_default_config()
</pre>
</div>
</div>
</div>

<div id="outline-container-org612a9bb" class="outline-4">
<h4 id="org612a9bb"><span class="section-number-4">3.1.3.</span> cond (switch/case equivalent)</h4>
<div class="outline-text-4" id="text-3-1-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">cond</span>
 ((&lt; x 0) (message <span class="org-string">"negative"</span>))
 ((= x 0) (message <span class="org-string">"zero"</span>))
 ((&lt; x 10) (message <span class="org-string">"small positive"</span>))
 ((&lt; x 100) (message <span class="org-string">"medium positive"</span>))
 (t (message <span class="org-string">"large positive"</span>)))  <span class="org-comment-delimiter">; </span><span class="org-comment">t is the default case (like "else")</span>
</pre>
</div>

<p>
Compare to:
</p>
<div class="org-src-container">
<pre class="src src-python"><span class="org-comment-delimiter"># </span><span class="org-comment">Python
</span><span class="org-keyword">if</span> x <span class="org-operator">&lt;</span> 0:
    <span class="org-builtin">print</span>(<span class="org-string">"negative"</span>)
<span class="org-keyword">elif</span> x <span class="org-operator">==</span> 0:
    <span class="org-builtin">print</span>(<span class="org-string">"zero"</span>)
<span class="org-keyword">elif</span> x <span class="org-operator">&lt;</span> 10:
    <span class="org-builtin">print</span>(<span class="org-string">"small positive"</span>)
<span class="org-keyword">elif</span> x <span class="org-operator">&lt;</span> 100:
    <span class="org-builtin">print</span>(<span class="org-string">"medium positive"</span>)
<span class="org-keyword">else</span>:
    <span class="org-builtin">print</span>(<span class="org-string">"large positive"</span>)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-javascript"><span class="org-comment-delimiter">// </span><span class="org-comment">JavaScript (modern switch with fall-through prevention)
</span><span class="org-keyword">switch</span> (<span class="org-constant">true</span>) {
    <span class="org-keyword">case</span> x &lt; 0:
        console.log(<span class="org-string">"negative"</span>);
        <span class="org-keyword">break</span>;
    <span class="org-keyword">case</span> x === 0:
        console.log(<span class="org-string">"zero"</span>);
        <span class="org-keyword">break</span>;
    <span class="org-keyword">case</span> x &lt; 10:
        console.log(<span class="org-string">"small positive"</span>);
        <span class="org-keyword">break</span>;
    <span class="org-keyword">case</span> x &lt; 100:
        console.log(<span class="org-string">"medium positive"</span>);
        <span class="org-keyword">break</span>;
    <span class="org-keyword">default</span>:
        console.log(<span class="org-string">"large positive"</span>);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org4828750" class="outline-4">
<h4 id="org4828750"><span class="section-number-4">3.1.4.</span> pcase (pattern matching)</h4>
<div class="outline-text-4" id="text-3-1-4">
<p>
Modern Elisp has powerful pattern matching:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">pcase</span> value
  ('nil (message <span class="org-string">"It's nil"</span>))
  ('t (message <span class="org-string">"It's t"</span>))
  (0 (message <span class="org-string">"It's zero"</span>))
  ((pred stringp) (message <span class="org-string">"It's a string: %s"</span> value))
  ((pred numberp) (message <span class="org-string">"It's a number: %d"</span> value))
  (`(,a ,b) (message <span class="org-string">"It's a two-element list: %s, %s"</span> a b))
  (_ (message <span class="org-string">"Something else"</span>)))
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org6d92fa7" class="outline-2">
<h2 id="org6d92fa7"><span class="section-number-2">4.</span> Loops and Iteration</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org5ea4b5b" class="outline-3">
<h3 id="org5ea4b5b"><span class="section-number-3">4.1.</span> while loop</h3>
<div class="outline-text-3" id="text-4-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">let</span> ((i 0))
  (<span class="org-keyword">while</span> (&lt; i 5)
    (message <span class="org-string">"i = %d"</span> i)
    (<span class="org-keyword">setq</span> i (1+ i))))
</pre>
</div>

<p>
Compare to:
</p>
<div class="org-src-container">
<pre class="src src-python"><span class="org-comment-delimiter"># </span><span class="org-comment">Python
</span><span class="org-variable-name">i</span> <span class="org-operator">=</span> 0
<span class="org-keyword">while</span> i <span class="org-operator">&lt;</span> 5:
    <span class="org-builtin">print</span>(f<span class="org-string">"i = </span>{i}<span class="org-string">"</span>)
    <span class="org-variable-name">i</span> <span class="org-operator">+=</span> 1
</pre>
</div>
</div>
</div>

<div id="outline-container-org76dcce0" class="outline-3">
<h3 id="org76dcce0"><span class="section-number-3">4.2.</span> dotimes (for loop with counter)</h3>
<div class="outline-text-3" id="text-4-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">Loop from 0 to 4
</span>(<span class="org-keyword">dotimes</span> (i 5)
  (message <span class="org-string">"i = %d"</span> i))

<span class="org-comment-delimiter">;; </span><span class="org-comment">With result value
</span>(<span class="org-keyword">dotimes</span> (i 5 <span class="org-string">"done"</span>)
  (message <span class="org-string">"i = %d"</span> i))
</pre>
</div>

<p>
Compare to:
</p>
<div class="org-src-container">
<pre class="src src-python"><span class="org-comment-delimiter"># </span><span class="org-comment">Python
</span><span class="org-keyword">for</span> i <span class="org-keyword">in</span> <span class="org-builtin">range</span>(5):
    <span class="org-builtin">print</span>(f<span class="org-string">"i = </span>{i}<span class="org-string">"</span>)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-javascript"><span class="org-comment-delimiter">// </span><span class="org-comment">JavaScript
</span><span class="org-keyword">for</span> (<span class="org-keyword">let</span> <span class="org-variable-name">i</span> = 0; i &lt; 5; i++) {
    console.log(<span class="org-string">`i = ${i}`</span>);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf1b0259" class="outline-3">
<h3 id="orgf1b0259"><span class="section-number-3">4.3.</span> dolist (foreach loop)</h3>
<div class="outline-text-3" id="text-4-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">dolist</span> (item '(apple banana cherry))
  (message <span class="org-string">"Fruit: %s"</span> item))

<span class="org-comment-delimiter">;; </span><span class="org-comment">With index using cl-loop
</span>(<span class="org-keyword">require</span> '<span class="org-constant">cl-lib</span>)
(<span class="org-keyword">cl-loop</span> for item in '(apple banana cherry)
         for i from 0
         do (message <span class="org-string">"%d: %s"</span> i item))
</pre>
</div>

<p>
Compare to:
</p>
<div class="org-src-container">
<pre class="src src-python"><span class="org-comment-delimiter"># </span><span class="org-comment">Python
</span><span class="org-keyword">for</span> item <span class="org-keyword">in</span> [<span class="org-string">'apple'</span>, <span class="org-string">'banana'</span>, <span class="org-string">'cherry'</span>]:
    <span class="org-builtin">print</span>(f<span class="org-string">"Fruit: </span>{item}<span class="org-string">"</span>)

<span class="org-keyword">for</span> i, item <span class="org-keyword">in</span> <span class="org-builtin">enumerate</span>([<span class="org-string">'apple'</span>, <span class="org-string">'banana'</span>, <span class="org-string">'cherry'</span>]):
    <span class="org-builtin">print</span>(f<span class="org-string">"</span>{i}<span class="org-string">: </span>{item}<span class="org-string">"</span>)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-javascript"><span class="org-comment-delimiter">// </span><span class="org-comment">JavaScript
</span>[<span class="org-string">'apple'</span>, <span class="org-string">'banana'</span>, <span class="org-string">'cherry'</span>].forEach(item =&gt; {
    console.log(<span class="org-string">`Fruit: ${item}`</span>);
});

[<span class="org-string">'apple'</span>, <span class="org-string">'banana'</span>, <span class="org-string">'cherry'</span>].forEach((item, i) =&gt; {
    console.log(<span class="org-string">`${i}: ${item}`</span>);
});
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd909b8c" class="outline-3">
<h3 id="orgd909b8c"><span class="section-number-3">4.4.</span> cl-loop (powerful iteration macro)</h3>
<div class="outline-text-3" id="text-4-4">
<p>
The <code>cl-loop</code> macro from Common Lisp is very powerful:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">require</span> '<span class="org-constant">cl-lib</span>)

<span class="org-comment-delimiter">;; </span><span class="org-comment">Collect squares
</span>(<span class="org-keyword">cl-loop</span> for i from 1 to 5
         collect (* i i))
<span class="org-comment-delimiter">;; </span><span class="org-comment">=&gt; (1 4 9 16 25)
</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">Sum numbers
</span>(<span class="org-keyword">cl-loop</span> for i from 1 to 10
         sum i)
<span class="org-comment-delimiter">;; </span><span class="org-comment">=&gt; 55
</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">Filter and transform
</span>(<span class="org-keyword">cl-loop</span> for i from 1 to 10
         when (cl-evenp i)
         collect (* i 2))
<span class="org-comment-delimiter">;; </span><span class="org-comment">=&gt; (4 8 12 16 20)
</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">Iterate over lists
</span>(<span class="org-keyword">cl-loop</span> for item in '(1 2 3 4 5)
         when (&gt; item 2)
         collect item)
<span class="org-comment-delimiter">;; </span><span class="org-comment">=&gt; (3 4 5)</span>
</pre>
</div>
</div>
</div>
