content/emacs-lisp.org
** mapcar (map/transform)

#+BEGIN_SRC emacs-lisp
;; Square each number
(mapcar (lambda (x) (* x x)) '(1 2 3 4 5))
;; => (1 4 9 16 25)

;; Convert to strings
(mapcar #'number-to-string '(1 2 3))
;; => ("1" "2" "3")
#+END_SRC

Compare to:
#+BEGIN_SRC python
# Python
list(map(lambda x: x * x, [1, 2, 3, 4, 5]))
# or
[x * x for x in [1, 2, 3, 4, 5]]
#+END_SRC

#+BEGIN_SRC javascript
// JavaScript
[1, 2, 3, 4, 5].map(x => x * x);
#+END_SRC

** seq-filter (filter)

#+BEGIN_SRC emacs-lisp
(require 'seq)

;; Filter even numbers
(seq-filter (lambda (x) (= (mod x 2) 0)) '(1 2 3 4 5 6))
;; => (2 4 6)

;; Using cl-lib
(require 'cl-lib)
(cl-remove-if-not #'cl-evenp '(1 2 3 4 5 6))
;; => (2 4 6)
#+END_SRC

Compare to:
#+BEGIN_SRC python
# Python
list(filter(lambda x: x % 2 == 0, [1, 2, 3, 4, 5, 6]))
# or
[x for x in [1, 2, 3, 4, 5, 6] if x % 2 == 0]
#+END_SRC

* Recursion

Recursion in Elisp works just like other languages, but be aware that Elisp doesn't have tail-call optimization by default.

** Understanding Tail-Call Optimization

In many functional programming languages, *tail-call optimization* (TCO) allows recursive functions to run without consuming stack space when the recursive call is in "tail position" (the last operation before returning). This means you can write recursive functions that iterate millions of times without stack overflow.

Compare to other languages:

#+BEGIN_SRC python
# Python - NO tail-call optimization
# This will cause a stack overflow with large n
def factorial(n):
    if n <= 1:
        return 1
    return n * factorial(n - 1)  # NOT tail-recursive (multiplication happens after)
#+END_SRC

#+BEGIN_SRC javascript
// JavaScript - NO tail-call optimization in most engines
// (ES6 spec includes it, but most browsers don't implement it)
function factorial(n, acc = 1) {
    if (n <= 1) return acc;
    return factorial(n - 1, n * acc);  // tail-recursive, but not optimized
}
#+END_SRC

*In Emacs Lisp*: By default, there is NO tail-call optimization. This means deeply recursive functions can exhaust the stack (~max-lisp-eval-depth~, default is around 800-1600). You have a few options:

1. *Use iteration instead* (while, dotimes, dolist) - most common approach
2. *Use ~cl-labels~* with tail recursion - not truly optimized, but cleaner code
3. *Increase ~max-lisp-eval-depth~* - temporary workaround, not recommended
4. *Use trampolining* - advanced technique to simulate TCO

For most Emacs Lisp programming, prefer iteration over deep recursion. Recursion is great for tree structures and small problem sizes, but use loops for large datasets.

** Simple Recursion

#+BEGIN_SRC emacs-lisp
;; Factorial
(defun factorial (n)
  "Calculate factorial of N."
  (if (<= n 1)
      1
    (* n (factorial (1- n)))))

(factorial 5)  ; => 120

;; Fibonacci
(defun fibonacci (n)
  "Calculate the Nth Fibonacci number."
  (cond
   ((<= n 0) 0)
   ((= n 1) 1)
   (t (+ (fibonacci (1- n))
         (fibonacci (- n 2))))))

(fibonacci 10)  ; => 55
#+END_SRC

** Tail Recursion with Named let

#+BEGIN_SRC emacs-lisp
(require 'cl-lib)

;; Tail-recursive factorial
(defun factorial-tail (n)
  "Calculate factorial using tail recursion."
  (cl-labels ((fact-helper (n acc)
                (if (<= n 1)
                    acc
                  (fact-helper (1- n) (* n acc)))))
    (fact-helper n 1)))

(factorial-tail 5)  ; => 120
#+END_SRC

** List Recursion

#+BEGIN_SRC emacs-lisp
;; Sum a list recursively
(defun sum-list (lst)
  "Sum all numbers in LST."
  (if (null lst)
      0
    (+ (car lst) (sum-list (cdr lst)))))

(sum-list '(1 2 3 4 5))  ; => 15

;; Reverse a list
(defun my-reverse (lst)
  "Reverse LST recursively."
  (if (null lst)
      nil
    (append (my-reverse (cdr lst)) (list (car lst)))))

(my-reverse '(1 2 3 4 5))  ; => (5 4 3 2 1)
#+END_SRC

** Tree Recursion

#+BEGIN_SRC emacs-lisp
;; Flatten a nested list
(defun flatten (lst)
  "Flatten a nested list LST."
  (cond
   ((null lst) nil)
   ((listp (car lst))
    (append (flatten (car lst))
            (flatten (cdr lst))))
   (t (cons (car lst)
            (flatten (cdr lst))))))

(flatten '(1 (2 3) ((4) 5) 6))  ; => (1 2 3 4 5 6)
#+END_SRC

* Functions

