emacs-lisp.html

<div id="outline-container-orga6deec3" class="outline-3">
<h3 id="orga6deec3"><span class="section-number-3">4.5.</span> mapcar (map/transform)</h3>
<div class="outline-text-3" id="text-4-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">Square each number
</span>(mapcar (<span class="org-keyword">lambda</span> (x) (* x x)) '(1 2 3 4 5))
<span class="org-comment-delimiter">;; </span><span class="org-comment">=&gt; (1 4 9 16 25)
</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">Convert to strings
</span>(mapcar #'number-to-string '(1 2 3))
<span class="org-comment-delimiter">;; </span><span class="org-comment">=&gt; ("1" "2" "3")</span>
</pre>
</div>

<p>
Compare to:
</p>
<div class="org-src-container">
<pre class="src src-python"><span class="org-comment-delimiter"># </span><span class="org-comment">Python
</span><span class="org-builtin">list</span>(<span class="org-builtin">map</span>(<span class="org-keyword">lambda</span> x: x <span class="org-operator">*</span> x, [1, 2, 3, 4, 5]))
<span class="org-comment-delimiter"># </span><span class="org-comment">or
</span>[x <span class="org-operator">*</span> x <span class="org-keyword">for</span> x <span class="org-keyword">in</span> [1, 2, 3, 4, 5]]
</pre>
</div>

<div class="org-src-container">
<pre class="src src-javascript"><span class="org-comment-delimiter">// </span><span class="org-comment">JavaScript
</span>[1, 2, 3, 4, 5].map(x =&gt; x * x);
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf622947" class="outline-3">
<h3 id="orgf622947"><span class="section-number-3">4.6.</span> seq-filter (filter)</h3>
<div class="outline-text-3" id="text-4-6">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">require</span> '<span class="org-constant">seq</span>)

<span class="org-comment-delimiter">;; </span><span class="org-comment">Filter even numbers
</span>(seq-filter (<span class="org-keyword">lambda</span> (x) (= (mod x 2) 0)) '(1 2 3 4 5 6))
<span class="org-comment-delimiter">;; </span><span class="org-comment">=&gt; (2 4 6)
</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">Using cl-lib
</span>(<span class="org-keyword">require</span> '<span class="org-constant">cl-lib</span>)
(cl-remove-if-not #'cl-evenp '(1 2 3 4 5 6))
<span class="org-comment-delimiter">;; </span><span class="org-comment">=&gt; (2 4 6)</span>
</pre>
</div>

<p>
Compare to:
</p>
<div class="org-src-container">
<pre class="src src-python"><span class="org-comment-delimiter"># </span><span class="org-comment">Python
</span><span class="org-builtin">list</span>(<span class="org-builtin">filter</span>(<span class="org-keyword">lambda</span> x: x <span class="org-operator">%</span> 2 <span class="org-operator">==</span> 0, [1, 2, 3, 4, 5, 6]))
<span class="org-comment-delimiter"># </span><span class="org-comment">or
</span>[x <span class="org-keyword">for</span> x <span class="org-keyword">in</span> [1, 2, 3, 4, 5, 6] <span class="org-keyword">if</span> x <span class="org-operator">%</span> 2 <span class="org-operator">==</span> 0]
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgef52d02" class="outline-2">
<h2 id="orgef52d02"><span class="section-number-2">5.</span> Recursion</h2>
<div class="outline-text-2" id="text-5">
<p>
Recursion in Elisp works just like other languages, but be aware that Elisp doesn't have tail-call optimization by default.
</p>
</div>

<div id="outline-container-org1d95262" class="outline-3">
<h3 id="org1d95262"><span class="section-number-3">5.1.</span> Understanding Tail-Call Optimization</h3>
<div class="outline-text-3" id="text-5-1">
<p>
In many functional programming languages, <b>tail-call optimization</b> (TCO) allows recursive functions to run without consuming stack space when the recursive call is in "tail position" (the last operation before returning). This means you can write recursive functions that iterate millions of times without stack overflow.
</p>

<p>
Compare to other languages:
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-comment-delimiter"># </span><span class="org-comment">Python - NO tail-call optimization
</span><span class="org-comment-delimiter"># </span><span class="org-comment">This will cause a stack overflow with large n
</span><span class="org-keyword">def</span> <span class="org-function-name">factorial</span>(n):
    <span class="org-keyword">if</span> n <span class="org-operator">&lt;=</span> 1:
        <span class="org-keyword">return</span> 1
    <span class="org-keyword">return</span> n <span class="org-operator">*</span> factorial(n <span class="org-operator">-</span> 1)  <span class="org-comment-delimiter"># </span><span class="org-comment">NOT tail-recursive (multiplication happens after)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-javascript"><span class="org-comment-delimiter">// </span><span class="org-comment">JavaScript - NO tail-call optimization in most engines
</span><span class="org-comment-delimiter">// </span><span class="org-comment">(ES6 spec includes it, but most browsers don't implement it)
</span><span class="org-keyword">function</span> <span class="org-function-name">factorial</span>(<span class="org-variable-name">n</span>, <span class="org-variable-name">acc</span> = 1) {
    <span class="org-keyword">if</span> (n &lt;= 1) <span class="org-keyword">return</span> acc;
    <span class="org-keyword">return</span> factorial(n - 1, n * acc);  <span class="org-comment-delimiter">// </span><span class="org-comment">tail-recursive, but not optimized
</span>}
</pre>
</div>

<p>
<b>In Emacs Lisp</b>: By default, there is NO tail-call optimization. This means deeply recursive functions can exhaust the stack (<code>max-lisp-eval-depth</code>, default is around 800-1600). You have a few options:
</p>

<ol class="org-ol">
<li><b>Use iteration instead</b> (while, dotimes, dolist) - most common approach</li>
<li><b>Use <code>cl-labels</code></b> with tail recursion - not truly optimized, but cleaner code</li>
<li><b>Increase <code>max-lisp-eval-depth</code></b> - temporary workaround, not recommended</li>
<li><b>Use trampolining</b> - advanced technique to simulate TCO</li>
</ol>

<p>
For most Emacs Lisp programming, prefer iteration over deep recursion. Recursion is great for tree structures and small problem sizes, but use loops for large datasets.
</p>
</div>
</div>

<div id="outline-container-org548d805" class="outline-3">
<h3 id="org548d805"><span class="section-number-3">5.2.</span> Simple Recursion</h3>
<div class="outline-text-3" id="text-5-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">Factorial
</span>(<span class="org-keyword">defun</span> <span class="org-function-name">factorial</span> (n)
  <span class="org-doc">"Calculate factorial of N."</span>
  (<span class="org-keyword">if</span> (&lt;= n 1)
      1
    (* n (factorial (1- n)))))

(factorial 5)  <span class="org-comment-delimiter">; </span><span class="org-comment">=&gt; 120
</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">Fibonacci
</span>(<span class="org-keyword">defun</span> <span class="org-function-name">fibonacci</span> (n)
  <span class="org-doc">"Calculate the Nth Fibonacci number."</span>
  (<span class="org-keyword">cond</span>
   ((&lt;= n 0) 0)
   ((= n 1) 1)
   (t (+ (fibonacci (1- n))
         (fibonacci (- n 2))))))

(fibonacci 10)  <span class="org-comment-delimiter">; </span><span class="org-comment">=&gt; 55</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org7d453e2" class="outline-3">
<h3 id="org7d453e2"><span class="section-number-3">5.3.</span> Tail Recursion with Named let</h3>
<div class="outline-text-3" id="text-5-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">require</span> '<span class="org-constant">cl-lib</span>)

<span class="org-comment-delimiter">;; </span><span class="org-comment">Tail-recursive factorial
</span>(<span class="org-keyword">defun</span> <span class="org-function-name">factorial-tail</span> (n)
  <span class="org-doc">"Calculate factorial using tail recursion."</span>
  (<span class="org-keyword">cl-labels</span> ((fact-helper (n acc)
                (<span class="org-keyword">if</span> (&lt;= n 1)
                    acc
                  (fact-helper (1- n) (* n acc)))))
    (fact-helper n 1)))

(factorial-tail 5)  <span class="org-comment-delimiter">; </span><span class="org-comment">=&gt; 120</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org1ca567a" class="outline-3">
<h3 id="org1ca567a"><span class="section-number-3">5.4.</span> List Recursion</h3>
<div class="outline-text-3" id="text-5-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">Sum a list recursively
</span>(<span class="org-keyword">defun</span> <span class="org-function-name">sum-list</span> (lst)
  <span class="org-doc">"Sum all numbers in LST."</span>
  (<span class="org-keyword">if</span> (null lst)
      0
    (+ (car lst) (sum-list (cdr lst)))))

(sum-list '(1 2 3 4 5))  <span class="org-comment-delimiter">; </span><span class="org-comment">=&gt; 15
</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">Reverse a list
</span>(<span class="org-keyword">defun</span> <span class="org-function-name">my-reverse</span> (lst)
  <span class="org-doc">"Reverse LST recursively."</span>
  (<span class="org-keyword">if</span> (null lst)
      nil
    (append (my-reverse (cdr lst)) (list (car lst)))))

(my-reverse '(1 2 3 4 5))  <span class="org-comment-delimiter">; </span><span class="org-comment">=&gt; (5 4 3 2 1)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org1fb602e" class="outline-3">
<h3 id="org1fb602e"><span class="section-number-3">5.5.</span> Tree Recursion</h3>
<div class="outline-text-3" id="text-5-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">Flatten a nested list
</span>(<span class="org-keyword">defun</span> <span class="org-function-name">flatten</span> (lst)
  <span class="org-doc">"Flatten a nested list LST."</span>
  (<span class="org-keyword">cond</span>
   ((null lst) nil)
   ((listp (car lst))
    (append (flatten (car lst))
            (flatten (cdr lst))))
   (t (cons (car lst)
            (flatten (cdr lst))))))

(flatten '(1 (2 3) ((4) 5) 6))  <span class="org-comment-delimiter">; </span><span class="org-comment">=&gt; (1 2 3 4 5 6)</span>
</pre>
</div>
</div>
</div>
</div>
