content/emacs-lisp.org
** Defining Functions

#+BEGIN_SRC emacs-lisp
;; Basic function
(defun greet (name)
  "Greet NAME with a message."
  (message "Hello, %s!" name))

;; Function with multiple parameters
(defun add-numbers (a b)
  "Add A and B and return the result."
  (+ a b))

;; Function with optional parameters
(defun greet-optional (name &optional title)
  "Greet NAME with optional TITLE."
  (if title
      (message "Hello, %s %s!" title name)
    (message "Hello, %s!" name)))

(greet-optional "Alice")          ; "Hello, Alice!"
(greet-optional "Alice" "Dr.")    ; "Hello, Dr. Alice!"

;; Function with rest parameters
(defun sum-all (&rest numbers)
  "Sum all NUMBERS."
  (apply #'+ numbers))

(sum-all 1 2 3 4 5)  ; => 15
#+END_SRC

** Lambda Functions (Anonymous Functions)

#+BEGIN_SRC emacs-lisp
;; Lambda function
(lambda (x) (* x x))

;; Using lambda with funcall
(funcall (lambda (x) (* x x)) 5)  ; => 25

;; Using lambda with mapcar
(mapcar (lambda (x) (* x 2)) '(1 2 3 4 5))
;; => (2 4 6 8 10)

;; Storing lambda in a variable
(setq square (lambda (x) (* x x)))
(funcall square 5)  ; => 25
#+END_SRC

Compare to:
#+BEGIN_SRC python
# Python
square = lambda x: x * x
square(5)  # => 25

list(map(lambda x: x * 2, [1, 2, 3, 4, 5]))
#+END_SRC

#+BEGIN_SRC javascript
// JavaScript
const square = x => x * x;
square(5);  // => 25

[1, 2, 3, 4, 5].map(x => x * 2);
#+END_SRC

** Interactive Functions (Commands)

Interactive functions can be called with ~M-x~ or bound to keys:

#+BEGIN_SRC emacs-lisp
(defun insert-current-date ()
  "Insert the current date at point."
  (interactive)
  (insert (format-time-string "%Y-%m-%d")))

;; With prefix argument
(defun insert-date (arg)
  "Insert date. With ARG, include time."
  (interactive "P")
  (insert (format-time-string
           (if arg "%Y-%m-%d %H:%M:%S" "%Y-%m-%d"))))

;; Reading from minibuffer
(defun greet-user (name)
  "Greet user by NAME."
  (interactive "sEnter your name: ")
  (message "Hello, %s!" name))
#+END_SRC

* Data Structures

** Lists

#+BEGIN_SRC emacs-lisp
;; Creating lists
(setq my-list '(1 2 3 4 5))
(setq my-list (list 1 2 3 4 5))

;; Accessing elements
(car my-list)     ; First element => 1
(cdr my-list)     ; Rest of list => (2 3 4 5)
(nth 2 my-list)   ; Third element (0-indexed) => 3

;; Adding elements
(cons 0 my-list)              ; Add to front => (0 1 2 3 4 5)
(append my-list '(6 7))       ; Concatenate => (1 2 3 4 5 6 7)
(push 0 my-list)              ; Modify my-list, add to front

;; Length
(length my-list)              ; => 5

;; Checking membership
(member 3 my-list)            ; => (3 4 5)
(memq 'a '(a b c))            ; => (a b c)
#+END_SRC

** Association Lists (alists)

Like dictionaries or hash maps:

#+BEGIN_SRC emacs-lisp
;; Creating an alist
(setq person '((name . "Alice")
               (age . 30)
               (city . "New York")))

;; Accessing values
(alist-get 'name person)           ; => "Alice"
(cdr (assq 'age person))           ; => 30
(assoc-default 'city person)       ; => "New York"

;; Adding/updating entries
(push '(job . "Engineer") person)
(setf (alist-get 'age person) 31)
#+END_SRC

** Hash Tables

For large datasets, hash tables are more efficient:

#+BEGIN_SRC emacs-lisp
;; Creating a hash table
(setq my-table (make-hash-table :test 'equal))

;; Adding values
(puthash "name" "Alice" my-table)
(puthash "age" 30 my-table)

;; Getting values
(gethash "name" my-table)          ; => "Alice"
(gethash "job" my-table "Unknown") ; => "Unknown" (default)

;; Checking if key exists
(gethash "age" my-table)           ; => 30

;; Iterating
(maphash (lambda (key value)
           (message "%s: %s" key value))
         my-table)

;; Number of entries
(hash-table-count my-table)        ; => 2
#+END_SRC

