emacs-lisp.html

<div id="outline-container-orga4df3ee" class="outline-2">
<h2 id="orga4df3ee"><span class="section-number-2">6.</span> Functions</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org8c0da96" class="outline-3">
<h3 id="org8c0da96"><span class="section-number-3">6.1.</span> Defining Functions</h3>
<div class="outline-text-3" id="text-6-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">Basic function
</span>(<span class="org-keyword">defun</span> <span class="org-function-name">greet</span> (name)
  <span class="org-doc">"Greet NAME with a message."</span>
  (message <span class="org-string">"Hello, %s!"</span> name))

<span class="org-comment-delimiter">;; </span><span class="org-comment">Function with multiple parameters
</span>(<span class="org-keyword">defun</span> <span class="org-function-name">add-numbers</span> (a b)
  <span class="org-doc">"Add A and B and return the result."</span>
  (+ a b))

<span class="org-comment-delimiter">;; </span><span class="org-comment">Function with optional parameters
</span>(<span class="org-keyword">defun</span> <span class="org-function-name">greet-optional</span> (name <span class="org-type">&amp;optional</span> title)
  <span class="org-doc">"Greet NAME with optional TITLE."</span>
  (<span class="org-keyword">if</span> title
      (message <span class="org-string">"Hello, %s %s!"</span> title name)
    (message <span class="org-string">"Hello, %s!"</span> name)))

(greet-optional <span class="org-string">"Alice"</span>)          <span class="org-comment-delimiter">; </span><span class="org-comment">"Hello, Alice!"
</span>(greet-optional <span class="org-string">"Alice"</span> <span class="org-string">"Dr."</span>)    <span class="org-comment-delimiter">; </span><span class="org-comment">"Hello, Dr. Alice!"
</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">Function with rest parameters
</span>(<span class="org-keyword">defun</span> <span class="org-function-name">sum-all</span> (<span class="org-type">&amp;rest</span> numbers)
  <span class="org-doc">"Sum all NUMBERS."</span>
  (apply #'+ numbers))

(sum-all 1 2 3 4 5)  <span class="org-comment-delimiter">; </span><span class="org-comment">=&gt; 15</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org3f6863c" class="outline-3">
<h3 id="org3f6863c"><span class="section-number-3">6.2.</span> Lambda Functions (Anonymous Functions)</h3>
<div class="outline-text-3" id="text-6-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">Lambda function
</span>(<span class="org-keyword">lambda</span> (x) (* x x))

<span class="org-comment-delimiter">;; </span><span class="org-comment">Using lambda with funcall
</span>(funcall (<span class="org-keyword">lambda</span> (x) (* x x)) 5)  <span class="org-comment-delimiter">; </span><span class="org-comment">=&gt; 25
</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">Using lambda with mapcar
</span>(mapcar (<span class="org-keyword">lambda</span> (x) (* x 2)) '(1 2 3 4 5))
<span class="org-comment-delimiter">;; </span><span class="org-comment">=&gt; (2 4 6 8 10)
</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">Storing lambda in a variable
</span>(<span class="org-keyword">setq</span> square (<span class="org-keyword">lambda</span> (x) (* x x)))
(funcall square 5)  <span class="org-comment-delimiter">; </span><span class="org-comment">=&gt; 25</span>
</pre>
</div>

<p>
Compare to:
</p>
<div class="org-src-container">
<pre class="src src-python"><span class="org-comment-delimiter"># </span><span class="org-comment">Python
</span><span class="org-variable-name">square</span> <span class="org-operator">=</span> <span class="org-keyword">lambda</span> x: x <span class="org-operator">*</span> x
square(5)  <span class="org-comment-delimiter"># </span><span class="org-comment">=&gt; 25
</span>
<span class="org-builtin">list</span>(<span class="org-builtin">map</span>(<span class="org-keyword">lambda</span> x: x <span class="org-operator">*</span> 2, [1, 2, 3, 4, 5]))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-javascript"><span class="org-comment-delimiter">// </span><span class="org-comment">JavaScript
</span><span class="org-keyword">const</span> <span class="org-variable-name">square</span> = x =&gt; x * x;
square(5);  <span class="org-comment-delimiter">// </span><span class="org-comment">=&gt; 25
</span>
[1, 2, 3, 4, 5].map(x =&gt; x * 2);
</pre>
</div>
</div>
</div>

<div id="outline-container-org76189df" class="outline-3">
<h3 id="org76189df"><span class="section-number-3">6.3.</span> Interactive Functions (Commands)</h3>
<div class="outline-text-3" id="text-6-3">
<p>
Interactive functions can be called with <code>M-x</code> or bound to keys:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">insert-current-date</span> ()
  <span class="org-doc">"Insert the current date at point."</span>
  (<span class="org-keyword">interactive</span>)
  (insert (format-time-string <span class="org-string">"%Y-%m-%d"</span>)))

<span class="org-comment-delimiter">;; </span><span class="org-comment">With prefix argument
</span>(<span class="org-keyword">defun</span> <span class="org-function-name">insert-date</span> (arg)
  <span class="org-doc">"Insert date. With ARG, include time."</span>
  (<span class="org-keyword">interactive</span> <span class="org-string">"P"</span>)
  (insert (format-time-string
           (<span class="org-keyword">if</span> arg <span class="org-string">"%Y-%m-%d %H:%M:%S"</span> <span class="org-string">"%Y-%m-%d"</span>))))

<span class="org-comment-delimiter">;; </span><span class="org-comment">Reading from minibuffer
</span>(<span class="org-keyword">defun</span> <span class="org-function-name">greet-user</span> (name)
  <span class="org-doc">"Greet user by NAME."</span>
  (<span class="org-keyword">interactive</span> <span class="org-string">"sEnter your name: "</span>)
  (message <span class="org-string">"Hello, %s!"</span> name))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org2ffb4ca" class="outline-2">
<h2 id="org2ffb4ca"><span class="section-number-2">7.</span> Data Structures</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-orgf7641b8" class="outline-3">
<h3 id="orgf7641b8"><span class="section-number-3">7.1.</span> Lists</h3>
<div class="outline-text-3" id="text-7-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">Creating lists
</span>(<span class="org-keyword">setq</span> my-list '(1 2 3 4 5))
(<span class="org-keyword">setq</span> my-list (list 1 2 3 4 5))

<span class="org-comment-delimiter">;; </span><span class="org-comment">Accessing elements
</span>(car my-list)     <span class="org-comment-delimiter">; </span><span class="org-comment">First element =&gt; 1
</span>(cdr my-list)     <span class="org-comment-delimiter">; </span><span class="org-comment">Rest of list =&gt; (2 3 4 5)
</span>(nth 2 my-list)   <span class="org-comment-delimiter">; </span><span class="org-comment">Third element (0-indexed) =&gt; 3
</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">Adding elements
</span>(cons 0 my-list)              <span class="org-comment-delimiter">; </span><span class="org-comment">Add to front =&gt; (0 1 2 3 4 5)
</span>(append my-list '(6 7))       <span class="org-comment-delimiter">; </span><span class="org-comment">Concatenate =&gt; (1 2 3 4 5 6 7)
</span>(<span class="org-keyword">push</span> 0 my-list)              <span class="org-comment-delimiter">; </span><span class="org-comment">Modify my-list, add to front
</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">Length
</span>(length my-list)              <span class="org-comment-delimiter">; </span><span class="org-comment">=&gt; 5
</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">Checking membership
</span>(member 3 my-list)            <span class="org-comment-delimiter">; </span><span class="org-comment">=&gt; (3 4 5)
</span>(memq 'a '(a b c))            <span class="org-comment-delimiter">; </span><span class="org-comment">=&gt; (a b c)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org8a2c78c" class="outline-3">
<h3 id="org8a2c78c"><span class="section-number-3">7.2.</span> Association Lists (alists)</h3>
<div class="outline-text-3" id="text-7-2">
<p>
Like dictionaries or hash maps:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">Creating an alist
</span>(<span class="org-keyword">setq</span> person '((name . <span class="org-string">"Alice"</span>)
               (age . 30)
               (city . <span class="org-string">"New York"</span>)))

<span class="org-comment-delimiter">;; </span><span class="org-comment">Accessing values
</span>(alist-get 'name person)           <span class="org-comment-delimiter">; </span><span class="org-comment">=&gt; "Alice"
</span>(cdr (assq 'age person))           <span class="org-comment-delimiter">; </span><span class="org-comment">=&gt; 30
</span>(assoc-default 'city person)       <span class="org-comment-delimiter">; </span><span class="org-comment">=&gt; "New York"
</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">Adding/updating entries
</span>(<span class="org-keyword">push</span> '(job . <span class="org-string">"Engineer"</span>) person)
(<span class="org-keyword">setf</span> (alist-get 'age person) 31)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgaede4b4" class="outline-3">
<h3 id="orgaede4b4"><span class="section-number-3">7.3.</span> Hash Tables</h3>
<div class="outline-text-3" id="text-7-3">
<p>
For large datasets, hash tables are more efficient:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">Creating a hash table
</span>(<span class="org-keyword">setq</span> my-table (make-hash-table <span class="org-builtin">:test</span> 'equal))

<span class="org-comment-delimiter">;; </span><span class="org-comment">Adding values
</span>(puthash <span class="org-string">"name"</span> <span class="org-string">"Alice"</span> my-table)
(puthash <span class="org-string">"age"</span> 30 my-table)

<span class="org-comment-delimiter">;; </span><span class="org-comment">Getting values
</span>(gethash <span class="org-string">"name"</span> my-table)          <span class="org-comment-delimiter">; </span><span class="org-comment">=&gt; "Alice"
</span>(gethash <span class="org-string">"job"</span> my-table <span class="org-string">"Unknown"</span>) <span class="org-comment-delimiter">; </span><span class="org-comment">=&gt; "Unknown" (default)
</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">Checking if key exists
</span>(gethash <span class="org-string">"age"</span> my-table)           <span class="org-comment-delimiter">; </span><span class="org-comment">=&gt; 30
</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">Iterating
</span>(maphash (<span class="org-keyword">lambda</span> (key value)
           (message <span class="org-string">"%s: %s"</span> key value))
         my-table)

<span class="org-comment-delimiter">;; </span><span class="org-comment">Number of entries
</span>(hash-table-count my-table)        <span class="org-comment-delimiter">; </span><span class="org-comment">=&gt; 2</span>
</pre>
</div>
</div>
</div>
