content/emacs-lisp.org
** Vectors (Arrays)

#+BEGIN_SRC emacs-lisp
;; Creating vectors
(setq my-vector [1 2 3 4 5])
(setq my-vector (vector 1 2 3 4 5))

;; Accessing elements
(aref my-vector 0)                 ; => 1
(elt my-vector 2)                  ; => 3

;; Setting elements
(aset my-vector 0 10)

;; Length
(length my-vector)                 ; => 5

;; Converting between lists and vectors
(vconcat '(1 2 3))                ; => [1 2 3]
(append [1 2 3] nil)              ; => (1 2 3)
#+END_SRC

* String Operations

#+BEGIN_SRC emacs-lisp
;; String concatenation
(concat "Hello" ", " "World!")     ; => "Hello, World!"

;; Format strings
(format "Name: %s, Age: %d" "Alice" 30)
;; => "Name: Alice, Age: 30"

;; String length
(length "hello")                   ; => 5

;; Substring
(substring "hello world" 0 5)      ; => "hello"
(substring "hello world" 6)        ; => "world"

;; String comparison
(string= "abc" "abc")              ; => t
(string< "abc" "def")              ; => t

;; Case conversion
(upcase "hello")                   ; => "HELLO"
(downcase "HELLO")                 ; => "hello"
(capitalize "hello world")         ; => "Hello World"

;; Split string
(split-string "one,two,three" ",") ; => ("one" "two" "three")

;; Join strings
(mapconcat #'identity '("a" "b" "c") ",")
;; => "a,b,c"

;; String replacement
(replace-regexp-in-string "world" "Emacs" "hello world")
;; => "hello Emacs"

;; Trimming whitespace
(string-trim "  hello  ")          ; => "hello"
#+END_SRC

* Practical Emacs Functions

Here are some useful functions that demonstrate real-world Elisp usage and can inspire your own customizations.

** Buffer and File Manipulation

*** Quick File Opening

#+BEGIN_SRC emacs-lisp
(defun open-config-file ()
  "Quickly open the Emacs configuration file."
  (interactive)
  (find-file user-init-file))

;; Bind it to a key
;; (global-set-key (kbd "C-c e c") #'open-config-file)
#+END_SRC

Why this is useful: Instead of navigating through directories, you can instantly open your config file. This pattern works for any frequently-accessed file.

*** Duplicate Current Line

#+BEGIN_SRC emacs-lisp
(defun duplicate-line ()
  "Duplicate the current line."
  (interactive)
  (let ((line-content (buffer-substring-no-properties
                       (line-beginning-position)
                       (line-end-position))))
    (end-of-line)
    (newline)
    (insert line-content)))

;; Bind to C-c d
;; (global-set-key (kbd "C-c d") #'duplicate-line)
#+END_SRC

Why this is useful: Many modern editors have this feature built-in. This shows how to work with buffer positions and text manipulation.

*** Move Line Up/Down

#+BEGIN_SRC emacs-lisp
(defun move-line-up ()
  "Move the current line up."
  (interactive)
  (transpose-lines 1)
  (forward-line -2))

(defun move-line-down ()
  "Move the current line down."
  (interactive)
  (forward-line 1)
  (transpose-lines 1)
  (forward-line -1))

;; Bind to M-up and M-down
;; (global-set-key (kbd "M-<up>") #'move-line-up)
;; (global-set-key (kbd "M-<down>") #'move-line-down)
#+END_SRC

Why this is useful: Quick line reordering without cut-paste. Demonstrates cursor movement and line manipulation.

** Text Processing

*** Sort Lines by Length

#+BEGIN_SRC emacs-lisp
(defun sort-lines-by-length (reverse beg end)
  "Sort lines in region by length.
With prefix arg REVERSE, sort in descending order."
  (interactive "P\nr")
  (save-excursion
    (save-restriction
      (narrow-to-region beg end)
      (goto-char (point-min))
      (let ((inhibit-field-text-motion t))
        (sort-subr reverse
                   #'forward-line
                   #'end-of-line
                   nil nil
                   (lambda (l1 l2)
                     (< (length (buffer-substring-no-properties
                                 (car l1) (cdr l1)))
                        (length (buffer-substring-no-properties
                                 (car l2) (cdr l2))))))))))
#+END_SRC

Why this is useful: Shows advanced region manipulation and custom sorting. Useful for organizing imports or data.

*** Insert UUID

#+BEGIN_SRC emacs-lisp
(defun insert-uuid ()
  "Insert a UUID at point."
  (interactive)
  (insert (string-trim (shell-command-to-string "uuidgen"))))
#+END_SRC

Why this is useful: Demonstrates calling external commands and inserting their output.

