emacs-lisp.html

<div id="outline-container-orgf334343" class="outline-3">
<h3 id="orgf334343"><span class="section-number-3">7.4.</span> Vectors (Arrays)</h3>
<div class="outline-text-3" id="text-7-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">Creating vectors
</span>(<span class="org-keyword">setq</span> my-vector [1 2 3 4 5])
(<span class="org-keyword">setq</span> my-vector (vector 1 2 3 4 5))

<span class="org-comment-delimiter">;; </span><span class="org-comment">Accessing elements
</span>(aref my-vector 0)                 <span class="org-comment-delimiter">; </span><span class="org-comment">=&gt; 1
</span>(elt my-vector 2)                  <span class="org-comment-delimiter">; </span><span class="org-comment">=&gt; 3
</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">Setting elements
</span>(aset my-vector 0 10)

<span class="org-comment-delimiter">;; </span><span class="org-comment">Length
</span>(length my-vector)                 <span class="org-comment-delimiter">; </span><span class="org-comment">=&gt; 5
</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">Converting between lists and vectors
</span>(vconcat '(1 2 3))                <span class="org-comment-delimiter">; </span><span class="org-comment">=&gt; [1 2 3]
</span>(append [1 2 3] nil)              <span class="org-comment-delimiter">; </span><span class="org-comment">=&gt; (1 2 3)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orga0248ce" class="outline-2">
<h2 id="orga0248ce"><span class="section-number-2">8.</span> String Operations</h2>
<div class="outline-text-2" id="text-8">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">String concatenation
</span>(concat <span class="org-string">"Hello"</span> <span class="org-string">", "</span> <span class="org-string">"World!"</span>)     <span class="org-comment-delimiter">; </span><span class="org-comment">=&gt; "Hello, World!"
</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">Format strings
</span>(format <span class="org-string">"Name: %s, Age: %d"</span> <span class="org-string">"Alice"</span> 30)
<span class="org-comment-delimiter">;; </span><span class="org-comment">=&gt; "Name: Alice, Age: 30"
</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">String length
</span>(length <span class="org-string">"hello"</span>)                   <span class="org-comment-delimiter">; </span><span class="org-comment">=&gt; 5
</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">Substring
</span>(substring <span class="org-string">"hello world"</span> 0 5)      <span class="org-comment-delimiter">; </span><span class="org-comment">=&gt; "hello"
</span>(substring <span class="org-string">"hello world"</span> 6)        <span class="org-comment-delimiter">; </span><span class="org-comment">=&gt; "world"
</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">String comparison
</span>(string= <span class="org-string">"abc"</span> <span class="org-string">"abc"</span>)              <span class="org-comment-delimiter">; </span><span class="org-comment">=&gt; t
</span>(string&lt; <span class="org-string">"abc"</span> <span class="org-string">"def"</span>)              <span class="org-comment-delimiter">; </span><span class="org-comment">=&gt; t
</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">Case conversion
</span>(upcase <span class="org-string">"hello"</span>)                   <span class="org-comment-delimiter">; </span><span class="org-comment">=&gt; "HELLO"
</span>(downcase <span class="org-string">"HELLO"</span>)                 <span class="org-comment-delimiter">; </span><span class="org-comment">=&gt; "hello"
</span>(capitalize <span class="org-string">"hello world"</span>)         <span class="org-comment-delimiter">; </span><span class="org-comment">=&gt; "Hello World"
</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">Split string
</span>(split-string <span class="org-string">"one,two,three"</span> <span class="org-string">","</span>) <span class="org-comment-delimiter">; </span><span class="org-comment">=&gt; ("one" "two" "three")
</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">Join strings
</span>(mapconcat #'identity '(<span class="org-string">"a"</span> <span class="org-string">"b"</span> <span class="org-string">"c"</span>) <span class="org-string">","</span>)
<span class="org-comment-delimiter">;; </span><span class="org-comment">=&gt; "a,b,c"
</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">String replacement
</span>(replace-regexp-in-string <span class="org-string">"world"</span> <span class="org-string">"Emacs"</span> <span class="org-string">"hello world"</span>)
<span class="org-comment-delimiter">;; </span><span class="org-comment">=&gt; "hello Emacs"
</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">Trimming whitespace
</span>(string-trim <span class="org-string">"  hello  "</span>)          <span class="org-comment-delimiter">; </span><span class="org-comment">=&gt; "hello"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org60ec7ae" class="outline-2">
<h2 id="org60ec7ae"><span class="section-number-2">9.</span> Practical Emacs Functions</h2>
<div class="outline-text-2" id="text-9">
<p>
Here are some useful functions that demonstrate real-world Elisp usage and can inspire your own customizations.
</p>
</div>

<div id="outline-container-orgcdc1c8c" class="outline-3">
<h3 id="orgcdc1c8c"><span class="section-number-3">9.1.</span> Buffer and File Manipulation</h3>
<div class="outline-text-3" id="text-9-1">
</div>
<div id="outline-container-org4d2f4cd" class="outline-4">
<h4 id="org4d2f4cd"><span class="section-number-4">9.1.1.</span> Quick File Opening</h4>
<div class="outline-text-4" id="text-9-1-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">open-config-file</span> ()
  <span class="org-doc">"Quickly open the Emacs configuration file."</span>
  (<span class="org-keyword">interactive</span>)
  (find-file user-init-file))

<span class="org-comment-delimiter">;; </span><span class="org-comment">Bind it to a key
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">(global-set-key (kbd "C-c e c") #'open-config-file)</span>
</pre>
</div>

<p>
Why this is useful: Instead of navigating through directories, you can instantly open your config file. This pattern works for any frequently-accessed file.
</p>
</div>
</div>

<div id="outline-container-orge58c7b2" class="outline-4">
<h4 id="orge58c7b2"><span class="section-number-4">9.1.2.</span> Duplicate Current Line</h4>
<div class="outline-text-4" id="text-9-1-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">duplicate-line</span> ()
  <span class="org-doc">"Duplicate the current line."</span>
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">let</span> ((line-content (buffer-substring-no-properties
                       (line-beginning-position)
                       (line-end-position))))
    (end-of-line)
    (newline)
    (insert line-content)))

<span class="org-comment-delimiter">;; </span><span class="org-comment">Bind to C-c d
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">(global-set-key (kbd "C-c d") #'duplicate-line)</span>
</pre>
</div>

<p>
Why this is useful: Many modern editors have this feature built-in. This shows how to work with buffer positions and text manipulation.
</p>
</div>
</div>

<div id="outline-container-org0e2964e" class="outline-4">
<h4 id="org0e2964e"><span class="section-number-4">9.1.3.</span> Move Line Up/Down</h4>
<div class="outline-text-4" id="text-9-1-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">move-line-up</span> ()
  <span class="org-doc">"Move the current line up."</span>
  (<span class="org-keyword">interactive</span>)
  (transpose-lines 1)
  (forward-line -2))

(<span class="org-keyword">defun</span> <span class="org-function-name">move-line-down</span> ()
  <span class="org-doc">"Move the current line down."</span>
  (<span class="org-keyword">interactive</span>)
  (forward-line 1)
  (transpose-lines 1)
  (forward-line -1))

<span class="org-comment-delimiter">;; </span><span class="org-comment">Bind to M-up and M-down
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">(global-set-key (kbd "M-&lt;up&gt;") #'move-line-up)
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">(global-set-key (kbd "M-&lt;down&gt;") #'move-line-down)</span>
</pre>
</div>

<p>
Why this is useful: Quick line reordering without cut-paste. Demonstrates cursor movement and line manipulation.
</p>
</div>
</div>
</div>

<div id="outline-container-org37c5d9a" class="outline-3">
<h3 id="org37c5d9a"><span class="section-number-3">9.2.</span> Text Processing</h3>
<div class="outline-text-3" id="text-9-2">
</div>
<div id="outline-container-org9d32e56" class="outline-4">
<h4 id="org9d32e56"><span class="section-number-4">9.2.1.</span> Sort Lines by Length</h4>
<div class="outline-text-4" id="text-9-2-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">sort-lines-by-length</span> (reverse beg end)
  <span class="org-doc">"Sort lines in region by length.
With prefix arg REVERSE, sort in descending order."</span>
  (<span class="org-keyword">interactive</span> <span class="org-string">"P\nr"</span>)
  (<span class="org-keyword">save-excursion</span>
    (<span class="org-keyword">save-restriction</span>
      (narrow-to-region beg end)
      (goto-char (point-min))
      (<span class="org-keyword">let</span> ((inhibit-field-text-motion t))
        (sort-subr reverse
                   #'forward-line
                   #'end-of-line
                   nil nil
                   (<span class="org-keyword">lambda</span> (l1 l2)
                     (&lt; (length (buffer-substring-no-properties
                                 (car l1) (cdr l1)))
                        (length (buffer-substring-no-properties
                                 (car l2) (cdr l2))))))))))
</pre>
</div>

<p>
Why this is useful: Shows advanced region manipulation and custom sorting. Useful for organizing imports or data.
</p>
</div>
</div>

<div id="outline-container-org9d4f2e1" class="outline-4">
<h4 id="org9d4f2e1"><span class="section-number-4">9.2.2.</span> Insert UUID</h4>
<div class="outline-text-4" id="text-9-2-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">insert-uuid</span> ()
  <span class="org-doc">"Insert a UUID at point."</span>
  (<span class="org-keyword">interactive</span>)
  (insert (string-trim (shell-command-to-string <span class="org-string">"uuidgen"</span>))))
</pre>
</div>

<p>
Why this is useful: Demonstrates calling external commands and inserting their output.
</p>
</div>
</div>
