content/emacs-lisp.org
*** Count Words in Region

#+BEGIN_SRC emacs-lisp
(defun count-words-region (beg end)
  "Count words in region and display in minibuffer."
  (interactive "r")
  (let ((words (count-words beg end))
        (chars (- end beg))
        (lines (count-lines beg end)))
    (message "Region has %d words, %d characters, %d lines"
             words chars lines)))
#+END_SRC

Why this is useful: Provides quick statistics about selected text. Shows how to work with regions.

** Window and Buffer Management

*** Split Window and Move to It

#+BEGIN_SRC emacs-lisp
(defun split-window-below-and-focus ()
  "Split window horizontally and move to the new window."
  (interactive)
  (split-window-below)
  (other-window 1))

(defun split-window-right-and-focus ()
  "Split window vertically and move to the new window."
  (interactive)
  (split-window-right)
  (other-window 1))

;; Bind them
;; (global-set-key (kbd "C-x 2") #'split-window-below-and-focus)
;; (global-set-key (kbd "C-x 3") #'split-window-right-and-focus)
#+END_SRC

Why this is useful: Improves the default split behavior by automatically moving focus. Small quality-of-life improvement.

*** Kill Other Buffers

#+BEGIN_SRC emacs-lisp
(defun kill-other-buffers ()
  "Kill all buffers except the current one."
  (interactive)
  (when (yes-or-no-p "Kill all other buffers? ")
    (let ((current-buf (current-buffer)))
      (dolist (buffer (buffer-list))
        (unless (or (eq buffer current-buf)
                    (string-prefix-p " " (buffer-name buffer)))
          (kill-buffer buffer))))
    (message "Killed all other buffers")))
#+END_SRC

Why this is useful: Clean workspace quickly. Shows buffer iteration and filtering.

*** Toggle Between Most Recent Buffers

#+BEGIN_SRC emacs-lisp
(defun switch-to-previous-buffer ()
  "Switch to the most recently used buffer."
  (interactive)
  (switch-to-buffer (other-buffer (current-buffer) 1)))

;; Bind to C-c b
;; (global-set-key (kbd "C-c b") #'switch-to-previous-buffer)
#+END_SRC

Why this is useful: Quick toggling between two files, like Alt+Tab for buffers.

** Search and Navigation

*** Search in Project

#+BEGIN_SRC emacs-lisp
(defun search-in-project (search-term)
  "Search for SEARCH-TERM in project using grep."
  (interactive "sSearch term: ")
  (let ((default-directory (project-root (project-current t))))
    (grep-find (format "find . -type f -not -path '*/\\.*' -exec grep -nH '%s' {} +"
                       search-term))))
#+END_SRC

Why this is useful: Quick project-wide search. Shows integration with external tools and project handling.

*** Jump to Previous/Next Blank Line

#+BEGIN_SRC emacs-lisp
(defun jump-to-previous-blank-line ()
  "Jump to the previous blank line."
  (interactive)
  (re-search-backward "^[[:space:]]*$" nil t))

(defun jump-to-next-blank-line ()
  "Jump to the next blank line."
  (interactive)
  (forward-line 1)
  (re-search-forward "^[[:space:]]*$" nil t)
  (beginning-of-line))

;; Bind them
;; (global-set-key (kbd "M-p") #'jump-to-previous-blank-line)
;; (global-set-key (kbd "M-n") #'jump-to-next-blank-line)
#+END_SRC

Why this is useful: Navigate by logical blocks instead of lines. Shows regex searching in buffers.

** Development Helpers

*** Insert Current Timestamp

#+BEGIN_SRC emacs-lisp
(defun insert-timestamp ()
  "Insert current timestamp in ISO 8601 format."
  (interactive)
  (insert (format-time-string "%Y-%m-%d %H:%M:%S")))

(defun insert-date ()
  "Insert current date."
  (interactive)
  (insert (format-time-string "%Y-%m-%d")))
#+END_SRC

Why this is useful: Quick logging and note-taking. Shows time formatting.

*** Comment or Uncomment Region with Repeat

#+BEGIN_SRC emacs-lisp
(defun toggle-comment-line-or-region ()
  "Comment or uncomment the current line or region."
  (interactive)
  (if (use-region-p)
      (comment-or-uncomment-region (region-beginning) (region-end))
    (comment-or-uncomment-region (line-beginning-position) (line-end-position))))

;; Bind to C-c c
;; (global-set-key (kbd "C-c c") #'toggle-comment-line-or-region)
#+END_SRC

Why this is useful: Unified commenting that works on both regions and lines. Shows region detection.

*** Open URL at Point

#+BEGIN_SRC emacs-lisp
(defun open-url-at-point ()
  "Open URL at point in default browser."
  (interactive)
  (let ((url (thing-at-point 'url)))
    (if url
        (browse-url url)
      (message "No URL found at point"))))
#+END_SRC

Why this is useful: Quick link opening from any buffer. Shows text property detection.

** Automation and Workflow

