emacs-lisp.html

<div id="outline-container-org598154c" class="outline-4">
<h4 id="org598154c"><span class="section-number-4">9.2.3.</span> Count Words in Region</h4>
<div class="outline-text-4" id="text-9-2-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">count-words-region</span> (beg end)
  <span class="org-doc">"Count words in region and display in minibuffer."</span>
  (<span class="org-keyword">interactive</span> <span class="org-string">"r"</span>)
  (<span class="org-keyword">let</span> ((words (count-words beg end))
        (chars (- end beg))
        (lines (count-lines beg end)))
    (message <span class="org-string">"Region has %d words, %d characters, %d lines"</span>
             words chars lines)))
</pre>
</div>

<p>
Why this is useful: Provides quick statistics about selected text. Shows how to work with regions.
</p>
</div>
</div>
</div>

<div id="outline-container-org7c8798f" class="outline-3">
<h3 id="org7c8798f"><span class="section-number-3">9.3.</span> Window and Buffer Management</h3>
<div class="outline-text-3" id="text-9-3">
</div>
<div id="outline-container-org81897b7" class="outline-4">
<h4 id="org81897b7"><span class="section-number-4">9.3.1.</span> Split Window and Move to It</h4>
<div class="outline-text-4" id="text-9-3-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">split-window-below-and-focus</span> ()
  <span class="org-doc">"Split window horizontally and move to the new window."</span>
  (<span class="org-keyword">interactive</span>)
  (split-window-below)
  (other-window 1))

(<span class="org-keyword">defun</span> <span class="org-function-name">split-window-right-and-focus</span> ()
  <span class="org-doc">"Split window vertically and move to the new window."</span>
  (<span class="org-keyword">interactive</span>)
  (split-window-right)
  (other-window 1))

<span class="org-comment-delimiter">;; </span><span class="org-comment">Bind them
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">(global-set-key (kbd "C-x 2") #'split-window-below-and-focus)
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">(global-set-key (kbd "C-x 3") #'split-window-right-and-focus)</span>
</pre>
</div>

<p>
Why this is useful: Improves the default split behavior by automatically moving focus. Small quality-of-life improvement.
</p>
</div>
</div>

<div id="outline-container-orgbf4aefb" class="outline-4">
<h4 id="orgbf4aefb"><span class="section-number-4">9.3.2.</span> Kill Other Buffers</h4>
<div class="outline-text-4" id="text-9-3-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">kill-other-buffers</span> ()
  <span class="org-doc">"Kill all buffers except the current one."</span>
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">when</span> (yes-or-no-p <span class="org-string">"Kill all other buffers? "</span>)
    (<span class="org-keyword">let</span> ((current-buf (current-buffer)))
      (<span class="org-keyword">dolist</span> (buffer (buffer-list))
        (<span class="org-keyword">unless</span> (<span class="org-keyword">or</span> (eq buffer current-buf)
                    (string-prefix-p <span class="org-string">" "</span> (buffer-name buffer)))
          (kill-buffer buffer))))
    (message <span class="org-string">"Killed all other buffers"</span>)))
</pre>
</div>

<p>
Why this is useful: Clean workspace quickly. Shows buffer iteration and filtering.
</p>
</div>
</div>

<div id="outline-container-orge8f4890" class="outline-4">
<h4 id="orge8f4890"><span class="section-number-4">9.3.3.</span> Toggle Between Most Recent Buffers</h4>
<div class="outline-text-4" id="text-9-3-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">switch-to-previous-buffer</span> ()
  <span class="org-doc">"Switch to the most recently used buffer."</span>
  (<span class="org-keyword">interactive</span>)
  (switch-to-buffer (other-buffer (current-buffer) 1)))

<span class="org-comment-delimiter">;; </span><span class="org-comment">Bind to C-c b
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">(global-set-key (kbd "C-c b") #'switch-to-previous-buffer)</span>
</pre>
</div>

<p>
Why this is useful: Quick toggling between two files, like Alt+Tab for buffers.
</p>
</div>
</div>
</div>

<div id="outline-container-org17ed0aa" class="outline-3">
<h3 id="org17ed0aa"><span class="section-number-3">9.4.</span> Search and Navigation</h3>
<div class="outline-text-3" id="text-9-4">
</div>
<div id="outline-container-org836a868" class="outline-4">
<h4 id="org836a868"><span class="section-number-4">9.4.1.</span> Search in Project</h4>
<div class="outline-text-4" id="text-9-4-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">search-in-project</span> (search-term)
  <span class="org-doc">"Search for SEARCH-TERM in project using grep."</span>
  (<span class="org-keyword">interactive</span> <span class="org-string">"sSearch term: "</span>)
  (<span class="org-keyword">let</span> ((default-directory (project-root (project-current t))))
    (grep-find (format <span class="org-string">"find . -type f -not -path '</span><span class="org-string"><span class="org-constant">*/\\.*</span></span><span class="org-string">' -exec grep -nH '</span><span class="org-string"><span class="org-constant">%s</span></span><span class="org-string">' {} +"</span>
                       search-term))))
</pre>
</div>

<p>
Why this is useful: Quick project-wide search. Shows integration with external tools and project handling.
</p>
</div>
</div>

<div id="outline-container-org6869f28" class="outline-4">
<h4 id="org6869f28"><span class="section-number-4">9.4.2.</span> Jump to Previous/Next Blank Line</h4>
<div class="outline-text-4" id="text-9-4-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">jump-to-previous-blank-line</span> ()
  <span class="org-doc">"Jump to the previous blank line."</span>
  (<span class="org-keyword">interactive</span>)
  (re-search-backward <span class="org-string">"^[[:space:]]*$"</span> nil t))

(<span class="org-keyword">defun</span> <span class="org-function-name">jump-to-next-blank-line</span> ()
  <span class="org-doc">"Jump to the next blank line."</span>
  (<span class="org-keyword">interactive</span>)
  (forward-line 1)
  (re-search-forward <span class="org-string">"^[[:space:]]*$"</span> nil t)
  (beginning-of-line))

<span class="org-comment-delimiter">;; </span><span class="org-comment">Bind them
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">(global-set-key (kbd "M-p") #'jump-to-previous-blank-line)
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">(global-set-key (kbd "M-n") #'jump-to-next-blank-line)</span>
</pre>
</div>

<p>
Why this is useful: Navigate by logical blocks instead of lines. Shows regex searching in buffers.
</p>
</div>
</div>
</div>

<div id="outline-container-org46aaab2" class="outline-3">
<h3 id="org46aaab2"><span class="section-number-3">9.5.</span> Development Helpers</h3>
<div class="outline-text-3" id="text-9-5">
</div>
<div id="outline-container-org237d1ab" class="outline-4">
<h4 id="org237d1ab"><span class="section-number-4">9.5.1.</span> Insert Current Timestamp</h4>
<div class="outline-text-4" id="text-9-5-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">insert-timestamp</span> ()
  <span class="org-doc">"Insert current timestamp in ISO 8601 format."</span>
  (<span class="org-keyword">interactive</span>)
  (insert (format-time-string <span class="org-string">"%Y-%m-%d %H:%M:%S"</span>)))

(<span class="org-keyword">defun</span> <span class="org-function-name">insert-date</span> ()
  <span class="org-doc">"Insert current date."</span>
  (<span class="org-keyword">interactive</span>)
  (insert (format-time-string <span class="org-string">"%Y-%m-%d"</span>)))
</pre>
</div>

<p>
Why this is useful: Quick logging and note-taking. Shows time formatting.
</p>
</div>
</div>

<div id="outline-container-org386962d" class="outline-4">
<h4 id="org386962d"><span class="section-number-4">9.5.2.</span> Comment or Uncomment Region with Repeat</h4>
<div class="outline-text-4" id="text-9-5-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">toggle-comment-line-or-region</span> ()
  <span class="org-doc">"Comment or uncomment the current line or region."</span>
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">if</span> (use-region-p)
      (comment-or-uncomment-region (region-beginning) (region-end))
    (comment-or-uncomment-region (line-beginning-position) (line-end-position))))

<span class="org-comment-delimiter">;; </span><span class="org-comment">Bind to C-c c
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">(global-set-key (kbd "C-c c") #'toggle-comment-line-or-region)</span>
</pre>
</div>

<p>
Why this is useful: Unified commenting that works on both regions and lines. Shows region detection.
</p>
</div>
</div>

<div id="outline-container-orgfabd9a1" class="outline-4">
<h4 id="orgfabd9a1"><span class="section-number-4">9.5.3.</span> Open URL at Point</h4>
<div class="outline-text-4" id="text-9-5-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">open-url-at-point</span> ()
  <span class="org-doc">"Open URL at point in default browser."</span>
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">let</span> ((url (thing-at-point 'url)))
    (<span class="org-keyword">if</span> url
        (browse-url url)
      (message <span class="org-string">"No URL found at point"</span>))))
</pre>
</div>

<p>
Why this is useful: Quick link opening from any buffer. Shows text property detection.
</p>
</div>
</div>
</div>

<div id="outline-container-orga7fed09" class="outline-3">
<h3 id="orga7fed09"><span class="section-number-3">9.6.</span> Automation and Workflow</h3>
<div class="outline-text-3" id="text-9-6">
</div>
