content/emacs-lisp.org
*** Auto-Insert File Headers

#+BEGIN_SRC emacs-lisp
(defun insert-elisp-header ()
  "Insert a standard header for Emacs Lisp files."
  (interactive)
  (goto-char (point-min))
  (insert (format ";;; %s --- Summary -*- lexical-binding: t -*-\n\n"
                  (file-name-nondirectory buffer-file-name)))
  (insert ";;; Commentary:\n\n")
  (insert ";; Description here\n\n")
  (insert ";;; Code:\n\n\n\n")
  (insert (format "(provide '%s)\n"
                  (file-name-base buffer-file-name)))
  (insert (format ";;; %s ends here\n"
                  (file-name-nondirectory buffer-file-name)))
  (goto-char (point-min))
  (search-forward ";;; Code:\n\n"))
#+END_SRC

Why this is useful: Standardizes file structure. Shows file name manipulation and cursor positioning.

*** Quick Scratch Buffer

#+BEGIN_SRC emacs-lisp
(defun create-scratch-buffer ()
  "Create a new scratch buffer."
  (interactive)
  (let ((buffer-name (format "*scratch-%s*"
                             (format-time-string "%Y%m%d-%H%M%S"))))
    (switch-to-buffer (get-buffer-create buffer-name))
    (emacs-lisp-mode)))
#+END_SRC

Why this is useful: Create temporary workspaces without affecting the main scratch buffer.

** Advanced: Macros and Code Generation

*** Create Getters and Setters

#+BEGIN_SRC emacs-lisp
(defun create-accessor-functions (struct-name fields)
  "Generate getter/setter functions for STRUCT-NAME with FIELDS."
  (dolist (field fields)
    (let ((getter-name (intern (format "%s-%s" struct-name field)))
          (setter-name (intern (format "%s-set-%s" struct-name field))))
      (fset getter-name
            `(lambda (obj)
               ,(format "Get %s from OBJ." field)
               (plist-get obj ,(intern (format ":%s" field)))))
      (fset setter-name
            `(lambda (obj value)
               ,(format "Set %s in OBJ to VALUE." field)
               (plist-put obj ,(intern (format ":%s" field)) value))))))

;; Usage:
;; (create-accessor-functions "person" '(name age email))
;; Now you have: person-name, person-set-name, etc.
#+END_SRC

Why this is useful: Demonstrates metaprogramming and code generation. Shows how Lisp can write Lisp.

* Error Handling

#+BEGIN_SRC emacs-lisp
;; Basic error handling with condition-case
(condition-case err
    (/ 1 0)
  (arith-error (message "Arithmetic error: %s" err))
  (error (message "General error: %s" err)))

;; Ignore errors
(ignore-errors
  (delete-file "nonexistent-file.txt"))

;; Signal an error
(defun safe-divide (a b)
  "Divide A by B safely."
  (if (= b 0)
      (error "Cannot divide by zero")
    (/ a b)))

;; Using signals for flow control
(catch 'found
  (dolist (item '(1 2 3 4 5))
    (when (> item 3)
      (throw 'found item))))
;; => 4
#+END_SRC

* Common Pitfalls for New Users

** 1. nil vs '()

In Elisp, ~nil~ and ~'()~ are equivalent (both represent false and empty list):

#+BEGIN_SRC emacs-lisp
(eq nil '())        ; => t
(not nil)           ; => t
(not '())           ; => t
#+END_SRC

** 2. t vs non-nil

Any non-nil value is considered true:

#+BEGIN_SRC emacs-lisp
(if 0 "true" "false")       ; => "true" (0 is not nil)
(if "" "true" "false")      ; => "true" (empty string is not nil)
(if '() "true" "false")     ; => "false" (empty list is nil)
#+END_SRC

** 3. setq vs setf vs let

- ~setq~: Set a variable (quote the variable name)
- ~setf~: Generalized assignment (can set places like alist entries)
- ~let~: Create local bindings

#+BEGIN_SRC emacs-lisp
(setq x 10)                          ; Set x globally
(let ((x 20)) x)                     ; x is 20 in this scope
x                                    ; x is still 10 outside

(setq alist '((a . 1) (b . 2)))
(setf (alist-get 'a alist) 99)      ; Modify alist entry
#+END_SRC

** 4. Quote vs Backquote

- ~'~ (quote): Everything is literal
- ~`~ (backquote): Allows interpolation with ~,~

#+BEGIN_SRC emacs-lisp
(setq x 10)

'(x is x)                           ; => (x is x)
`(x is ,x)                          ; => (x is 10)
`(list of ,x and ,(+ x 5))          ; => (list of 10 and 15)
#+END_SRC

* Resources and Next Steps

** Learning More

- *Info Manual*: Press ~C-h i~ and select "Elisp" to read the comprehensive Emacs Lisp manual
- *Describe Function*: ~C-h f~ shows documentation for any function
- *Describe Variable*: ~C-h v~ shows documentation for any variable
- *Apropos*: ~C-h a~ searches for functions/variables by keyword

