emacs-lisp.html
<div id="outline-container-org7fba086" class="outline-4">
<h4 id="org7fba086"><span class="section-number-4">9.6.1.</span> Auto-Insert File Headers</h4>
<div class="outline-text-4" id="text-9-6-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">insert-elisp-header</span> ()
  <span class="org-doc">"Insert a standard header for Emacs Lisp files."</span>
  (<span class="org-keyword">interactive</span>)
  (goto-char (point-min))
  (insert (format <span class="org-string">";;; %s --- Summary -*- lexical-binding: t -*-\n\n"</span>
                  (file-name-nondirectory buffer-file-name)))
  (insert <span class="org-string">";;; Commentary:\n\n"</span>)
  (insert <span class="org-string">";; Description here\n\n"</span>)
  (insert <span class="org-string">";;; Code:\n\n\n\n"</span>)
  (insert (format <span class="org-string">"(provide '%s)\n"</span>
                  (file-name-base buffer-file-name)))
  (insert (format <span class="org-string">";;; %s ends here\n"</span>
                  (file-name-nondirectory buffer-file-name)))
  (goto-char (point-min))
  (search-forward <span class="org-string">";;; Code:\n\n"</span>))
</pre>
</div>

<p>
Why this is useful: Standardizes file structure. Shows file name manipulation and cursor positioning.
</p>
</div>
</div>

<div id="outline-container-org940ae6a" class="outline-4">
<h4 id="org940ae6a"><span class="section-number-4">9.6.2.</span> Quick Scratch Buffer</h4>
<div class="outline-text-4" id="text-9-6-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">create-scratch-buffer</span> ()
  <span class="org-doc">"Create a new scratch buffer."</span>
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">let</span> ((buffer-name (format <span class="org-string">"*scratch-%s*"</span>
                             (format-time-string <span class="org-string">"%Y%m%d-%H%M%S"</span>))))
    (switch-to-buffer (get-buffer-create buffer-name))
    (emacs-lisp-mode)))
</pre>
</div>

<p>
Why this is useful: Create temporary workspaces without affecting the main scratch buffer.
</p>
</div>
</div>
</div>

<div id="outline-container-orgc4f3549" class="outline-3">
<h3 id="orgc4f3549"><span class="section-number-3">9.7.</span> Advanced: Macros and Code Generation</h3>
<div class="outline-text-3" id="text-9-7">
</div>
<div id="outline-container-org1fbd15d" class="outline-4">
<h4 id="org1fbd15d"><span class="section-number-4">9.7.1.</span> Create Getters and Setters</h4>
<div class="outline-text-4" id="text-9-7-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">create-accessor-functions</span> (struct-name fields)
  <span class="org-doc">"Generate getter/setter functions for STRUCT-NAME with FIELDS."</span>
  (<span class="org-keyword">dolist</span> (field fields)
    (<span class="org-keyword">let</span> ((getter-name (intern (format <span class="org-string">"%s-%s"</span> struct-name field)))
          (setter-name (intern (format <span class="org-string">"%s-set-%s"</span> struct-name field))))
      (fset getter-name
            `(<span class="org-keyword">lambda</span> (obj)
               ,(format <span class="org-string">"Get %s from OBJ."</span> field)
               (plist-get obj ,(intern (format <span class="org-string">":%s"</span> field)))))
      (fset setter-name
            `(<span class="org-keyword">lambda</span> (obj value)
               ,(format <span class="org-string">"Set %s in OBJ to VALUE."</span> field)
               (plist-put obj ,(intern (format <span class="org-string">":%s"</span> field)) value))))))

<span class="org-comment-delimiter">;; </span><span class="org-comment">Usage:
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">(create-accessor-functions "person" '(name age email))
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">Now you have: person-name, person-set-name, etc.</span>
</pre>
</div>

<p>
Why this is useful: Demonstrates metaprogramming and code generation. Shows how Lisp can write Lisp.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org085dbd9" class="outline-2">
<h2 id="org085dbd9"><span class="section-number-2">10.</span> Error Handling</h2>
<div class="outline-text-2" id="text-10">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">Basic error handling with condition-case
</span>(<span class="org-keyword">condition-case</span> err
    (/ 1 0)
  (arith-error (message <span class="org-string">"Arithmetic error: %s"</span> err))
  (<span class="org-warning">error</span> (message <span class="org-string">"General error: %s"</span> err)))

<span class="org-comment-delimiter">;; </span><span class="org-comment">Ignore errors
</span>(<span class="org-keyword">ignore-errors</span>
  (delete-file <span class="org-string">"nonexistent-file.txt"</span>))

<span class="org-comment-delimiter">;; </span><span class="org-comment">Signal an error
</span>(<span class="org-keyword">defun</span> <span class="org-function-name">safe-divide</span> (a b)
  <span class="org-doc">"Divide A by B safely."</span>
  (<span class="org-keyword">if</span> (= b 0)
      (<span class="org-warning">error</span> <span class="org-string">"Cannot divide by zero"</span>)
    (/ a b)))

<span class="org-comment-delimiter">;; </span><span class="org-comment">Using signals for flow control
</span>(<span class="org-keyword">catch</span> '<span class="org-constant">found</span>
  (<span class="org-keyword">dolist</span> (item '(1 2 3 4 5))
    (<span class="org-keyword">when</span> (&gt; item 3)
      (<span class="org-keyword">throw</span> '<span class="org-constant">found</span> item))))
<span class="org-comment-delimiter">;; </span><span class="org-comment">=&gt; 4</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd36854b" class="outline-2">
<h2 id="orgd36854b"><span class="section-number-2">11.</span> Common Pitfalls for New Users</h2>
<div class="outline-text-2" id="text-11">
</div>
<div id="outline-container-org9e4e7fa" class="outline-3">
<h3 id="org9e4e7fa"><span class="section-number-3">11.1.</span> 1. nil vs '()</h3>
<div class="outline-text-3" id="text-11-1">
<p>
In Elisp, <code>nil</code> and <code>'()</code> are equivalent (both represent false and empty list):
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(eq nil '())        <span class="org-comment-delimiter">; </span><span class="org-comment">=&gt; t
</span>(not nil)           <span class="org-comment-delimiter">; </span><span class="org-comment">=&gt; t
</span>(not '())           <span class="org-comment-delimiter">; </span><span class="org-comment">=&gt; t</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org2f701df" class="outline-3">
<h3 id="org2f701df"><span class="section-number-3">11.2.</span> 2. t vs non-nil</h3>
<div class="outline-text-3" id="text-11-2">
<p>
Any non-nil value is considered true:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">if</span> 0 <span class="org-string">"true"</span> <span class="org-string">"false"</span>)       <span class="org-comment-delimiter">; </span><span class="org-comment">=&gt; "true" (0 is not nil)
</span>(<span class="org-keyword">if</span> <span class="org-string">""</span> <span class="org-string">"true"</span> <span class="org-string">"false"</span>)      <span class="org-comment-delimiter">; </span><span class="org-comment">=&gt; "true" (empty string is not nil)
</span>(<span class="org-keyword">if</span> '() <span class="org-string">"true"</span> <span class="org-string">"false"</span>)     <span class="org-comment-delimiter">; </span><span class="org-comment">=&gt; "false" (empty list is nil)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org413c624" class="outline-3">
<h3 id="org413c624"><span class="section-number-3">11.3.</span> 3. setq vs setf vs let</h3>
<div class="outline-text-3" id="text-11-3">
<ul class="org-ul">
<li><code>setq</code>: Set a variable (quote the variable name)</li>
<li><code>setf</code>: Generalized assignment (can set places like alist entries)</li>
<li><code>let</code>: Create local bindings</li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">setq</span> x 10)                          <span class="org-comment-delimiter">; </span><span class="org-comment">Set x globally
</span>(<span class="org-keyword">let</span> ((x 20)) x)                     <span class="org-comment-delimiter">; </span><span class="org-comment">x is 20 in this scope
</span>x                                    <span class="org-comment-delimiter">; </span><span class="org-comment">x is still 10 outside
</span>
(<span class="org-keyword">setq</span> alist '((a . 1) (b . 2)))
(<span class="org-keyword">setf</span> (alist-get 'a alist) 99)      <span class="org-comment-delimiter">; </span><span class="org-comment">Modify alist entry</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orga82c0f5" class="outline-3">
<h3 id="orga82c0f5"><span class="section-number-3">11.4.</span> 4. Quote vs Backquote</h3>
<div class="outline-text-3" id="text-11-4">
<ul class="org-ul">
<li><code>'</code> (quote): Everything is literal</li>
<li><code>`</code> (backquote): Allows interpolation with <code>,</code></li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">setq</span> x 10)

'(x is x)                           <span class="org-comment-delimiter">; </span><span class="org-comment">=&gt; (x is x)
</span>`(x is ,x)                          <span class="org-comment-delimiter">; </span><span class="org-comment">=&gt; (x is 10)
</span>`(list of ,x and ,(+ x 5))          <span class="org-comment-delimiter">; </span><span class="org-comment">=&gt; (list of 10 and 15)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org2e818f5" class="outline-2">
<h2 id="org2e818f5"><span class="section-number-2">12.</span> Resources and Next Steps</h2>
<div class="outline-text-2" id="text-12">
</div>
<div id="outline-container-org386c852" class="outline-3">
<h3 id="org386c852"><span class="section-number-3">12.1.</span> Learning More</h3>
<div class="outline-text-3" id="text-12-1">
<ul class="org-ul">
<li><b>Info Manual</b>: Press <code>C-h i</code> and select "Elisp" to read the comprehensive Emacs Lisp manual</li>
<li><b>Describe Function</b>: <code>C-h f</code> shows documentation for any function</li>
<li><b>Describe Variable</b>: <code>C-h v</code> shows documentation for any variable</li>
<li><b>Apropos</b>: <code>C-h a</code> searches for functions/variables by keyword</li>
</ul>
</div>
</div>
