content/emacs-lisp.org
** Practice Exercises

1. Write a function that reverses words in a sentence (but not the sentence itself)
   - Input: "Hello World from Emacs"
   - Output: "olleH dlroW morf scamE"

2. Create a function that finds all TODO comments in the current buffer and lists them

3. Build a simple timer that displays elapsed time in the mode line

4. Write a function that converts between camelCase and snake_case

5. Create a command that swaps the contents of two windows

** Common Libraries

- ~cl-lib~: Common Lisp extensions (more powerful iteration, data structures)
- ~seq~: Sequence manipulation functions (works on lists, vectors, strings)
- ~map~: Unified map operations (works on alists, plists, hash tables)
- ~subr-x~: Additional string and list utilities
- ~rx~: Readable regex construction

Example using ~rx~ for regex:

#+BEGIN_SRC emacs-lisp
(require 'rx)

;; Instead of: "\\([0-9]+\\)-\\([0-9]+\\)-\\([0-9]+\\)"
(rx (group (one-or-more digit)) "-"
    (group (one-or-more digit)) "-"
    (group (one-or-more digit)))
#+END_SRC

* Conclusion

Emacs Lisp is a powerful language for customizing and extending your editor. The key differences from other languages are:

1. *Prefix notation*: Functions come first, then arguments
2. *Everything is a list*: Code and data use the same structure
3. *Dynamic typing*: No type declarations needed
4. *Interactive development*: Evaluate code immediately with ~C-x C-e~
5. *Self-documenting*: Built-in help for all functions and variables
6. *Editor integration*: Direct access to buffers, windows, files

Start small: write simple functions to automate repetitive tasks in your workflow. As you get comfortable, you'll find yourself customizing Emacs to perfectly fit your needs.

Happy Hacking!
