emacs-lisp.html

<div id="outline-container-orgf9ff1c0" class="outline-3">
<h3 id="orgf9ff1c0"><span class="section-number-3">12.2.</span> Practice Exercises</h3>
<div class="outline-text-3" id="text-12-2">
<ol class="org-ol">
<li>Write a function that reverses words in a sentence (but not the sentence itself)
<ul class="org-ul">
<li>Input: "Hello World from Emacs"</li>
<li>Output: "olleH dlroW morf scamE"</li>
</ul></li>

<li>Create a function that finds all TODO comments in the current buffer and lists them</li>

<li>Build a simple timer that displays elapsed time in the mode line</li>

<li>Write a function that converts between camelCase and snake<sub>case</sub></li>

<li>Create a command that swaps the contents of two windows</li>
</ol>
</div>
</div>

<div id="outline-container-org101f92d" class="outline-3">
<h3 id="org101f92d"><span class="section-number-3">12.3.</span> Common Libraries</h3>
<div class="outline-text-3" id="text-12-3">
<ul class="org-ul">
<li><code>cl-lib</code>: Common Lisp extensions (more powerful iteration, data structures)</li>
<li><code>seq</code>: Sequence manipulation functions (works on lists, vectors, strings)</li>
<li><code>map</code>: Unified map operations (works on alists, plists, hash tables)</li>
<li><code>subr-x</code>: Additional string and list utilities</li>
<li><code>rx</code>: Readable regex construction</li>
</ul>

<p>
Example using <code>rx</code> for regex:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">require</span> '<span class="org-constant">rx</span>)

<span class="org-comment-delimiter">;; </span><span class="org-comment">Instead of: "\\([0-9]+\\)-\\([0-9]+\\)-\\([0-9]+\\)"
</span>(<span class="org-keyword">rx</span> (group (one-or-more digit)) <span class="org-string">"-"</span>
    (group (one-or-more digit)) <span class="org-string">"-"</span>
    (group (one-or-more digit)))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org7f3ae84" class="outline-2">
<h2 id="org7f3ae84"><span class="section-number-2">13.</span> Conclusion</h2>
<div class="outline-text-2" id="text-13">
<p>
Emacs Lisp is a powerful language for customizing and extending your editor. The key differences from other languages are:
</p>

<ol class="org-ol">
<li><b>Prefix notation</b>: Functions come first, then arguments</li>
<li><b>Everything is a list</b>: Code and data use the same structure</li>
<li><b>Dynamic typing</b>: No type declarations needed</li>
<li><b>Interactive development</b>: Evaluate code immediately with <code>C-x C-e</code></li>
<li><b>Self-documenting</b>: Built-in help for all functions and variables</li>
<li><b>Editor integration</b>: Direct access to buffers, windows, files</li>
</ol>

<p>
Start small: write simple functions to automate repetitive tasks in your workflow. As you get comfortable, you'll find yourself customizing Emacs to perfectly fit your needs.
</p>

<p>
Happy Hacking!
</p>
</div>
</div>
</main>
<footer id="postamble" class="status">
<p class="date">Date: 2025-10-14</p>
</footer>
</body>
</html>
